// 请求参数中需要使用到城市 id


//市级城市、县级城市
var bigcity=[
  //县级城市/////////////////////////////////////////////////////////////////////////////////////////////
  {
    "cityid": 101010100,
    "city": "北京"
  },
  {
    "cityid": 101010200,
    "city": "海淀"
  },
  {
    "cityid": 101010300,
    "city": "朝阳"
  },
  {
    "cityid": 101010400,
    "city": "顺义"
  },
  {
    "cityid": 101010500,
    "city": "怀柔"
  },
  {
    "cityid": 101010600,
    "city": "通州"
  },
  {
    "cityid": 101010700,
    "city": "昌平"
  },
  {
    "cityid": 101010800,
    "city": "延庆"
  },
  {
    "cityid": 101010900,
    "city": "丰台"
  },
  {
    "cityid": 101011000,
    "city": "石景山"
  },
  {
    "cityid": 101011100,
    "city": "大兴"
  },
  {
    "cityid": 101011200,
    "city": "房山"
  },
  {
    "cityid": 101011300,
    "city": "密云"
  },
  {
    "cityid": 101011400,
    "city": "门头沟"
  },
  {
    "cityid": 101011500,
    "city": "平谷"
  },
  {
    "cityid": 101020100,
    "city": "上海"
  },
  {
    "cityid": 101020200,
    "city": "闵行"
  },
  {
    "cityid": 101020300,
    "city": "宝山"
  },
  {
    "cityid": 101020500,
    "city": "嘉定"
  },
  {
    "cityid": 101020600,
    "city": "浦东南汇"
  },
  {
    "cityid": 101020700,
    "city": "金山"
  },
  {
    "cityid": 101020800,
    "city": "青浦"
  },
  {
    "cityid": 101020900,
    "city": "松江"
  },
  {
    "cityid": 101021000,
    "city": "奉贤"
  },
  {
    "cityid": 101021100,
    "city": "崇明"
  },
  {
    "cityid": 101021200,
    "city": "徐家汇"
  },
  {
    "cityid": 101021300,
    "city": "浦东"
  },
  {
    "cityid": 101030100,
    "city": "天津"
  },
  {
    "cityid": 101030200,
    "city": "武清"
  },
  {
    "cityid": 101030300,
    "city": "宝坻"
  },
  {
    "cityid": 101030400,
    "city": "东丽"
  },
  {
    "cityid": 101030500,
    "city": "西青"
  },
  {
    "cityid": 101030600,
    "city": "北辰"
  },
  {
    "cityid": 101030700,
    "city": "宁河"
  },
  {
    "cityid": 101030800,
    "city": "汉沽"
  },
  {
    "cityid": 101030900,
    "city": "静海"
  },
  {
    "cityid": 101031000,
    "city": "津南"
  },
  {
    "cityid": 101031100,
    "city": "塘沽"
  },
  {
    "cityid": 101031200,
    "city": "大港"
  },
  {
    "cityid": 101031400,
    "city": "蓟县"
  },
  {
    "cityid": 101040100,
    "city": "重庆"
  },
  {
    "cityid": 101040200,
    "city": "永川"
  },
  {
    "cityid": 101040300,
    "city": "合川"
  },
  {
    "cityid": 101040400,
    "city": "南川"
  },
  {
    "cityid": 101040500,
    "city": "江津"
  },
  {
    "cityid": 101040600,
    "city": "万盛"
  },
  {
    "cityid": 101040700,
    "city": "渝北"
  },
  {
    "cityid": 101040800,
    "city": "北碚"
  },
  {
    "cityid": 101040900,
    "city": "巴南"
  },
  {
    "cityid": 101041000,
    "city": "长寿"
  },
  {
    "cityid": 101041100,
    "city": "黔江"
  },
  {
    "cityid": 101041300,
    "city": "万州"
  },
  {
    "cityid": 101041400,
    "city": "涪陵"
  },
  {
    "cityid": 101041500,
    "city": "开县"
  },
  {
    "cityid": 101041600,
    "city": "城口"
  },
  {
    "cityid": 101041700,
    "city": "云阳"
  },
  {
    "cityid": 101041800,
    "city": "巫溪"
  },
  {
    "cityid": 101041900,
    "city": "奉节"
  },
  {
    "cityid": 101042000,
    "city": "巫山"
  },
  {
    "cityid": 101042100,
    "city": "潼南"
  },
  {
    "cityid": 101042200,
    "city": "垫江"
  },
  {
    "cityid": 101042300,
    "city": "梁平"
  },
  {
    "cityid": 101042400,
    "city": "忠县"
  },
  {
    "cityid": 101042500,
    "city": "石柱"
  },
  {
    "cityid": 101042600,
    "city": "大足"
  },
  {
    "cityid": 101042700,
    "city": "荣昌"
  },
  {
    "cityid": 101042800,
    "city": "铜梁"
  },
  {
    "cityid": 101042900,
    "city": "璧山"
  },
  {
    "cityid": 101043000,
    "city": "丰都"
  },
  {
    "cityid": 101043100,
    "city": "武隆"
  },
  {
    "cityid": 101043200,
    "city": "彭水"
  },
  {
    "cityid": 101043300,
    "city": "綦江"
  },
  {
    "cityid": 101043400,
    "city": "酉阳"
  },
  {
    "cityid": 101043600,
    "city": "秀山"
  },
  {
    "cityid": 101050101,
    "city": "哈尔滨"
  },
  {
    "cityid": 101050102,
    "city": "双城"
  },
  {
    "cityid": 101050103,
    "city": "呼兰"
  },
  {
    "cityid": 101050104,
    "city": "阿城"
  },
  {
    "cityid": 101050105,
    "city": "宾县"
  },
  {
    "cityid": 101050106,
    "city": "依兰"
  },
  {
    "cityid": 101050107,
    "city": "巴彦"
  },
  {
    "cityid": 101050108,
    "city": "通河"
  },
  {
    "cityid": 101050109,
    "city": "方正"
  },
  {
    "cityid": 101050110,
    "city": "延寿"
  },
  {
    "cityid": 101050111,
    "city": "尚志"
  },
  {
    "cityid": 101050112,
    "city": "五常"
  },
  {
    "cityid": 101050113,
    "city": "木兰"
  },
  {
    "cityid": 101050201,
    "city": "齐齐哈尔"
  },
  {
    "cityid": 101050202,
    "city": "讷河"
  },
  {
    "cityid": 101050203,
    "city": "龙江"
  },
  {
    "cityid": 101050204,
    "city": "甘南"
  },
  {
    "cityid": 101050205,
    "city": "富裕"
  },
  {
    "cityid": 101050206,
    "city": "依安"
  },
  {
    "cityid": 101050207,
    "city": "拜泉"
  },
  {
    "cityid": 101050208,
    "city": "克山"
  },
  {
    "cityid": 101050209,
    "city": "克东"
  },
  {
    "cityid": 101050210,
    "city": "泰来"
  },
  {
    "cityid": 101050301,
    "city": "牡丹江"
  },
  {
    "cityid": 101050302,
    "city": "海林"
  },
  {
    "cityid": 101050303,
    "city": "穆棱"
  },
  {
    "cityid": 101050304,
    "city": "林口"
  },
  {
    "cityid": 101050305,
    "city": "绥芬河"
  },
  {
    "cityid": 101050306,
    "city": "宁安"
  },
  {
    "cityid": 101050307,
    "city": "东宁"
  },
  {
    "cityid": 101050401,
    "city": "佳木斯"
  },
  {
    "cityid": 101050402,
    "city": "汤原"
  },
  {
    "cityid": 101050403,
    "city": "抚远"
  },
  {
    "cityid": 101050404,
    "city": "桦川"
  },
  {
    "cityid": 101050405,
    "city": "桦南"
  },
  {
    "cityid": 101050406,
    "city": "同江"
  },
  {
    "cityid": 101050407,
    "city": "富锦"
  },
  {
    "cityid": 101050501,
    "city": "绥化"
  },
  {
    "cityid": 101050502,
    "city": "肇东"
  },
  {
    "cityid": 101050503,
    "city": "安达"
  },
  {
    "cityid": 101050504,
    "city": "海伦"
  },
  {
    "cityid": 101050505,
    "city": "明水"
  },
  {
    "cityid": 101050506,
    "city": "望奎"
  },
  {
    "cityid": 101050507,
    "city": "兰西"
  },
  {
    "cityid": 101050508,
    "city": "青冈"
  },
  {
    "cityid": 101050509,
    "city": "庆安"
  },
  {
    "cityid": 101050510,
    "city": "绥棱"
  },
  {
    "cityid": 101050601,
    "city": "黑河"
  },
  {
    "cityid": 101050602,
    "city": "嫩江"
  },
  {
    "cityid": 101050603,
    "city": "孙吴"
  },
  {
    "cityid": 101050604,
    "city": "逊克"
  },
  {
    "cityid": 101050605,
    "city": "五大连池"
  },
  {
    "cityid": 101050606,
    "city": "北安"
  },
  {
    "cityid": 101050701,
    "city": "大兴安岭"
  },
  {
    "cityid": 101050702,
    "city": "塔河"
  },
  {
    "cityid": 101050703,
    "city": "漠河"
  },
  {
    "cityid": 101050704,
    "city": "呼玛"
  },
  {
    "cityid": 101050705,
    "city": "呼中"
  },
  {
    "cityid": 101050706,
    "city": "新林"
  },
  {
    "cityid": 101050708,
    "city": "加格达奇"
  },
  {
    "cityid": 101050801,
    "city": "伊春"
  },
  {
    "cityid": 101050802,
    "city": "乌伊岭"
  },
  {
    "cityid": 101050803,
    "city": "五营"
  },
  {
    "cityid": 101050804,
    "city": "铁力"
  },
  {
    "cityid": 101050805,
    "city": "嘉荫"
  },
  {
    "cityid": 101050901,
    "city": "大庆"
  },
  {
    "cityid": 101050902,
    "city": "林甸"
  },
  {
    "cityid": 101050903,
    "city": "肇州"
  },
  {
    "cityid": 101050904,
    "city": "肇源"
  },
  {
    "cityid": 101050905,
    "city": "杜尔伯特"
  },
  {
    "cityid": 101051002,
    "city": "七台河"
  },
  {
    "cityid": 101051003,
    "city": "勃利"
  },
  {
    "cityid": 101051101,
    "city": "鸡西"
  },
  {
    "cityid": 101051102,
    "city": "虎林"
  },
  {
    "cityid": 101051103,
    "city": "密山"
  },
  {
    "cityid": 101051104,
    "city": "鸡东"
  },
  {
    "cityid": 101051201,
    "city": "鹤岗"
  },
  {
    "cityid": 101051202,
    "city": "绥滨"
  },
  {
    "cityid": 101051203,
    "city": "萝北"
  },
  {
    "cityid": 101051301,
    "city": "双鸭山"
  },
  {
    "cityid": 101051302,
    "city": "集贤"
  },
  {
    "cityid": 101051303,
    "city": "宝清"
  },
  {
    "cityid": 101051304,
    "city": "饶河"
  },
  {
    "cityid": 101051305,
    "city": "友谊"
  },
  {
    "cityid": 101060101,
    "city": "长春"
  },
  {
    "cityid": 101060102,
    "city": "农安"
  },
  {
    "cityid": 101060103,
    "city": "德惠"
  },
  {
    "cityid": 101060104,
    "city": "九台"
  },
  {
    "cityid": 101060105,
    "city": "榆树"
  },
  {
    "cityid": 101060106,
    "city": "双阳"
  },
  {
    "cityid": 101060201,
    "city": "吉林"
  },
  {
    "cityid": 101060202,
    "city": "舒兰"
  },
  {
    "cityid": 101060203,
    "city": "永吉"
  },
  {
    "cityid": 101060204,
    "city": "蛟河"
  },
  {
    "cityid": 101060205,
    "city": "磐石"
  },
  {
    "cityid": 101060206,
    "city": "桦甸"
  },
  {
    "cityid": 101060301,
    "city": "延吉"
  },
  {
    "cityid": 101060302,
    "city": "敦化"
  },
  {
    "cityid": 101060303,
    "city": "安图"
  },
  {
    "cityid": 101060304,
    "city": "汪清"
  },
  {
    "cityid": 101060305,
    "city": "和龙"
  },
  {
    "cityid": 101060307,
    "city": "龙井"
  },
  {
    "cityid": 101060308,
    "city": "珲春"
  },
  {
    "cityid": 101060309,
    "city": "图们"
  },
  {
    "cityid": 101060401,
    "city": "四平"
  },
  {
    "cityid": 101060402,
    "city": "双辽"
  },
  {
    "cityid": 101060403,
    "city": "梨树"
  },
  {
    "cityid": 101060404,
    "city": "公主岭"
  },
  {
    "cityid": 101060405,
    "city": "伊通"
  },
  {
    "cityid": 101060501,
    "city": "通化"
  },
  {
    "cityid": 101060502,
    "city": "梅河口"
  },
  {
    "cityid": 101060503,
    "city": "柳河"
  },
  {
    "cityid": 101060504,
    "city": "辉南"
  },
  {
    "cityid": 101060505,
    "city": "集安"
  },
  {
    "cityid": 101060506,
    "city": "通化县"
  },
  {
    "cityid": 101060601,
    "city": "白城"
  },
  {
    "cityid": 101060602,
    "city": "洮南"
  },
  {
    "cityid": 101060603,
    "city": "大安"
  },
  {
    "cityid": 101060604,
    "city": "镇赉"
  },
  {
    "cityid": 101060605,
    "city": "通榆"
  },
  {
    "cityid": 101060701,
    "city": "辽源"
  },
  {
    "cityid": 101060702,
    "city": "东丰"
  },
  {
    "cityid": 101060703,
    "city": "东辽"
  },
  {
    "cityid": 101060801,
    "city": "松原"
  },
  {
    "cityid": 101060802,
    "city": "乾安"
  },
  {
    "cityid": 101060803,
    "city": "前郭"
  },
  {
    "cityid": 101060804,
    "city": "长岭"
  },
  {
    "cityid": 101060805,
    "city": "扶余"
  },
  {
    "cityid": 101060901,
    "city": "白山"
  },
  {
    "cityid": 101060902,
    "city": "靖宇"
  },
  {
    "cityid": 101060903,
    "city": "临江"
  },
  {
    "cityid": 101060904,
    "city": "东岗"
  },
  {
    "cityid": 101060905,
    "city": "长白"
  },
  {
    "cityid": 101060906,
    "city": "抚松"
  },
  {
    "cityid": 101060907,
    "city": "江源"
  },
  {
    "cityid": 101070101,
    "city": "沈阳"
  },
  {
    "cityid": 101070103,
    "city": "辽中"
  },
  {
    "cityid": 101070104,
    "city": "康平"
  },
  {
    "cityid": 101070105,
    "city": "法库"
  },
  {
    "cityid": 101070106,
    "city": "新民"
  },
  {
    "cityid": 101070201,
    "city": "大连"
  },
  {
    "cityid": 101070202,
    "city": "瓦房店"
  },
  {
    "cityid": 101070203,
    "city": "金州"
  },
  {
    "cityid": 101070204,
    "city": "普兰店"
  },
  {
    "cityid": 101070205,
    "city": "旅顺"
  },
  {
    "cityid": 101070206,
    "city": "长海"
  },
  {
    "cityid": 101070207,
    "city": "庄河"
  },
  {
    "cityid": 101070301,
    "city": "鞍山"
  },
  {
    "cityid": 101070302,
    "city": "台安"
  },
  {
    "cityid": 101070303,
    "city": "岫岩"
  },
  {
    "cityid": 101070304,
    "city": "海城"
  },
  {
    "cityid": 101070401,
    "city": "抚顺"
  },
  {
    "cityid": 101070402,
    "city": "新宾"
  },
  {
    "cityid": 101070403,
    "city": "清原"
  },
  {
    "cityid": 101070404,
    "city": "章党"
  },
  {
    "cityid": 101070501,
    "city": "本溪"
  },
  {
    "cityid": 101070502,
    "city": "本溪县"
  },
  {
    "cityid": 101070504,
    "city": "桓仁"
  },
  {
    "cityid": 101070601,
    "city": "丹东"
  },
  {
    "cityid": 101070602,
    "city": "凤城"
  },
  {
    "cityid": 101070603,
    "city": "宽甸"
  },
  {
    "cityid": 101070604,
    "city": "东港"
  },
  {
    "cityid": 101070701,
    "city": "锦州"
  },
  {
    "cityid": 101070702,
    "city": "凌海"
  },
  {
    "cityid": 101070704,
    "city": "义县"
  },
  {
    "cityid": 101070705,
    "city": "黑山"
  },
  {
    "cityid": 101070706,
    "city": "北镇"
  },
  {
    "cityid": 101070801,
    "city": "营口"
  },
  {
    "cityid": 101070802,
    "city": "大石桥"
  },
  {
    "cityid": 101070803,
    "city": "盖州"
  },
  {
    "cityid": 101070901,
    "city": "阜新"
  },
  {
    "cityid": 101070902,
    "city": "彰武"
  },
  {
    "cityid": 101071001,
    "city": "辽阳"
  },
  {
    "cityid": 101071002,
    "city": "辽阳县"
  },
  {
    "cityid": 101071003,
    "city": "灯塔"
  },
  {
    "cityid": 101071004,
    "city": "弓长岭"
  },
  {
    "cityid": 101071101,
    "city": "铁岭"
  },
  {
    "cityid": 101071102,
    "city": "开原"
  },
  {
    "cityid": 101071103,
    "city": "昌图"
  },
  {
    "cityid": 101071104,
    "city": "西丰"
  },
  {
    "cityid": 101071105,
    "city": "调兵山"
  },
  {
    "cityid": 101071201,
    "city": "朝阳"
  },
  {
    "cityid": 101071203,
    "city": "凌源"
  },
  {
    "cityid": 101071204,
    "city": "喀左"
  },
  {
    "cityid": 101071205,
    "city": "北票"
  },
  {
    "cityid": 101071207,
    "city": "建平县"
  },
  {
    "cityid": 101071301,
    "city": "盘锦"
  },
  {
    "cityid": 101071302,
    "city": "大洼"
  },
  {
    "cityid": 101071303,
    "city": "盘山"
  },
  {
    "cityid": 101071401,
    "city": "葫芦岛"
  },
  {
    "cityid": 101071402,
    "city": "建昌"
  },
  {
    "cityid": 101071403,
    "city": "绥中"
  },
  {
    "cityid": 101071404,
    "city": "兴城"
  },
  {
    "cityid": 101080101,
    "city": "呼和浩特"
  },
  {
    "cityid": 101080102,
    "city": "土左旗"
  },
  {
    "cityid": 101080103,
    "city": "托县"
  },
  {
    "cityid": 101080104,
    "city": "和林"
  },
  {
    "cityid": 101080105,
    "city": "清水河"
  },
  {
    "cityid": 101080106,
    "city": "呼市郊区"
  },
  {
    "cityid": 101080107,
    "city": "武川"
  },
  {
    "cityid": 101080201,
    "city": "包头"
  },
  {
    "cityid": 101080202,
    "city": "白云鄂博"
  },
  {
    "cityid": 101080203,
    "city": "满都拉"
  },
  {
    "cityid": 101080204,
    "city": "土右旗"
  },
  {
    "cityid": 101080205,
    "city": "固阳"
  },
  {
    "cityid": 101080206,
    "city": "达茂旗"
  },
  {
    "cityid": 101080207,
    "city": "希拉穆仁"
  },
  {
    "cityid": 101080301,
    "city": "乌海"
  },
  {
    "cityid": 101080401,
    "city": "集宁"
  },
  {
    "cityid": 101080402,
    "city": "卓资"
  },
  {
    "cityid": 101080403,
    "city": "化德"
  },
  {
    "cityid": 101080404,
    "city": "商都"
  },
  {
    "cityid": 101080406,
    "city": "兴和"
  },
  {
    "cityid": 101080407,
    "city": "凉城"
  },
  {
    "cityid": 101080408,
    "city": "察右前旗"
  },
  {
    "cityid": 101080409,
    "city": "察右中旗"
  },
  {
    "cityid": 101080410,
    "city": "察右后旗"
  },
  {
    "cityid": 101080411,
    "city": "四子王旗"
  },
  {
    "cityid": 101080412,
    "city": "丰镇"
  },
  {
    "cityid": 101080501,
    "city": "通辽"
  },
  {
    "cityid": 101080502,
    "city": "舍伯吐"
  },
  {
    "cityid": 101080503,
    "city": "科左中旗"
  },
  {
    "cityid": 101080504,
    "city": "科左后旗"
  },
  {
    "cityid": 101080505,
    "city": "青龙山"
  },
  {
    "cityid": 101080506,
    "city": "开鲁"
  },
  {
    "cityid": 101080507,
    "city": "库伦"
  },
  {
    "cityid": 101080508,
    "city": "奈曼"
  },
  {
    "cityid": 101080509,
    "city": "扎鲁特"
  },
  {
    "cityid": 101080510,
    "city": "高力板"
  },
  {
    "cityid": 101080511,
    "city": "巴雅尔吐胡硕"
  },
  {
    "cityid": 101080601,
    "city": "赤峰"
  },
  {
    "cityid": 101080603,
    "city": "阿鲁旗"
  },
  {
    "cityid": 101080604,
    "city": "浩尔吐"
  },
  {
    "cityid": 101080605,
    "city": "巴林左旗"
  },
  {
    "cityid": 101080606,
    "city": "巴林右旗"
  },
  {
    "cityid": 101080607,
    "city": "林西"
  },
  {
    "cityid": 101080608,
    "city": "克什克腾"
  },
  {
    "cityid": 101080609,
    "city": "翁牛特"
  },
  {
    "cityid": 101080610,
    "city": "岗子"
  },
  {
    "cityid": 101080611,
    "city": "喀喇沁"
  },
  {
    "cityid": 101080612,
    "city": "八里罕"
  },
  {
    "cityid": 101080613,
    "city": "宁城"
  },
  {
    "cityid": 101080614,
    "city": "敖汉"
  },
  {
    "cityid": 101080615,
    "city": "宝国吐"
  },
  {
    "cityid": 101080701,
    "city": "鄂尔多斯"
  },
  {
    "cityid": 101080703,
    "city": "达拉特"
  },
  {
    "cityid": 101080704,
    "city": "准格尔"
  },
  {
    "cityid": 101080705,
    "city": "鄂前旗"
  },
  {
    "cityid": 101080706,
    "city": "河南"
  },
  {
    "cityid": 101080707,
    "city": "伊克乌素"
  },
  {
    "cityid": 101080708,
    "city": "鄂托克"
  },
  {
    "cityid": 101080709,
    "city": "杭锦旗"
  },
  {
    "cityid": 101080710,
    "city": "乌审旗"
  },
  {
    "cityid": 101080711,
    "city": "伊金霍洛"
  },
  {
    "cityid": 101080712,
    "city": "乌审召"
  },
  {
    "cityid": 101080713,
    "city": "东胜"
  },
  {
    "cityid": 101080801,
    "city": "临河"
  },
  {
    "cityid": 101080802,
    "city": "五原"
  },
  {
    "cityid": 101080803,
    "city": "磴口"
  },
  {
    "cityid": 101080804,
    "city": "乌前旗"
  },
  {
    "cityid": 101080805,
    "city": "大佘太"
  },
  {
    "cityid": 101080806,
    "city": "乌中旗"
  },
  {
    "cityid": 101080807,
    "city": "乌后旗"
  },
  {
    "cityid": 101080808,
    "city": "海力素"
  },
  {
    "cityid": 101080809,
    "city": "那仁宝力格"
  },
  {
    "cityid": 101080810,
    "city": "杭锦后旗"
  },
  {
    "cityid": 101080901,
    "city": "锡林浩特"
  },
  {
    "cityid": 101080903,
    "city": "二连浩特"
  },
  {
    "cityid": 101080904,
    "city": "阿巴嘎"
  },
  {
    "cityid": 101080906,
    "city": "苏左旗"
  },
  {
    "cityid": 101080907,
    "city": "苏右旗"
  },
  {
    "cityid": 101080908,
    "city": "朱日和"
  },
  {
    "cityid": 101080909,
    "city": "东乌旗"
  },
  {
    "cityid": 101080910,
    "city": "西乌旗"
  },
  {
    "cityid": 101080911,
    "city": "太仆寺"
  },
  {
    "cityid": 101080912,
    "city": "镶黄旗"
  },
  {
    "cityid": 101080913,
    "city": "正镶白旗"
  },
  {
    "cityid": 101080914,
    "city": "正蓝旗"
  },
  {
    "cityid": 101080915,
    "city": "多伦"
  },
  {
    "cityid": 101080916,
    "city": "博克图"
  },
  {
    "cityid": 101080917,
    "city": "乌拉盖"
  },
  {
    "cityid": 101081001,
    "city": "海拉尔"
  },
  {
    "cityid": 101081002,
    "city": "小二沟"
  },
  {
    "cityid": 101081003,
    "city": "阿荣旗"
  },
  {
    "cityid": 101081004,
    "city": "莫力达瓦"
  },
  {
    "cityid": 101081005,
    "city": "鄂伦春旗"
  },
  {
    "cityid": 101081006,
    "city": "鄂温克旗"
  },
  {
    "cityid": 101081007,
    "city": "陈旗"
  },
  {
    "cityid": 101081008,
    "city": "新左旗"
  },
  {
    "cityid": 101081009,
    "city": "新右旗"
  },
  {
    "cityid": 101081010,
    "city": "满洲里"
  },
  {
    "cityid": 101081011,
    "city": "牙克石"
  },
  {
    "cityid": 101081012,
    "city": "扎兰屯"
  },
  {
    "cityid": 101081014,
    "city": "额尔古纳"
  },
  {
    "cityid": 101081015,
    "city": "根河"
  },
  {
    "cityid": 101081016,
    "city": "图里河"
  },
  {
    "cityid": 101081101,
    "city": "乌兰浩特"
  },
  {
    "cityid": 101081102,
    "city": "阿尔山"
  },
  {
    "cityid": 101081103,
    "city": "科右中旗"
  },
  {
    "cityid": 101081104,
    "city": "胡尔勒"
  },
  {
    "cityid": 101081105,
    "city": "扎赉特"
  },
  {
    "cityid": 101081106,
    "city": "索伦"
  },
  {
    "cityid": 101081107,
    "city": "突泉"
  },
  {
    "cityid": 101081108,
    "city": "霍林郭勒"
  },
  {
    "cityid": 101081109,
    "city": "科右前旗"
  },
  {
    "cityid": 101081201,
    "city": "阿左旗"
  },
  {
    "cityid": 101081202,
    "city": "阿右旗"
  },
  {
    "cityid": 101081203,
    "city": "额济纳"
  },
  {
    "cityid": 101081204,
    "city": "拐子湖"
  },
  {
    "cityid": 101081205,
    "city": "吉兰太"
  },
  {
    "cityid": 101081206,
    "city": "锡林高勒"
  },
  {
    "cityid": 101081207,
    "city": "头道湖"
  },
  {
    "cityid": 101081208,
    "city": "中泉子"
  },
  {
    "cityid": 101081209,
    "city": "诺尔公"
  },
  {
    "cityid": 101081210,
    "city": "雅布赖"
  },
  {
    "cityid": 101081211,
    "city": "乌斯泰"
  },
  {
    "cityid": 101081212,
    "city": "孪井滩"
  },
  {
    "cityid": 101090101,
    "city": "石家庄"
  },
  {
    "cityid": 101090102,
    "city": "井陉"
  },
  {
    "cityid": 101090103,
    "city": "正定"
  },
  {
    "cityid": 101090104,
    "city": "栾城"
  },
  {
    "cityid": 101090105,
    "city": "行唐"
  },
  {
    "cityid": 101090106,
    "city": "灵寿"
  },
  {
    "cityid": 101090107,
    "city": "高邑"
  },
  {
    "cityid": 101090108,
    "city": "深泽"
  },
  {
    "cityid": 101090109,
    "city": "赞皇"
  },
  {
    "cityid": 101090110,
    "city": "无极"
  },
  {
    "cityid": 101090111,
    "city": "平山"
  },
  {
    "cityid": 101090112,
    "city": "元氏"
  },
  {
    "cityid": 101090113,
    "city": "赵县"
  },
  {
    "cityid": 101090114,
    "city": "辛集"
  },
  {
    "cityid": 101090115,
    "city": "藁城"
  },
  {
    "cityid": 101090116,
    "city": "晋州"
  },
  {
    "cityid": 101090117,
    "city": "新乐"
  },
  {
    "cityid": 101090118,
    "city": "鹿泉"
  },
  {
    "cityid": 101090201,
    "city": "保定"
  },
  {
    "cityid": 101090202,
    "city": "满城"
  },
  {
    "cityid": 101090203,
    "city": "阜平"
  },
  {
    "cityid": 101090204,
    "city": "徐水"
  },
  {
    "cityid": 101090205,
    "city": "唐县"
  },
  {
    "cityid": 101090206,
    "city": "高阳"
  },
  {
    "cityid": 101090207,
    "city": "容城"
  },
  {
    "cityid": 101090209,
    "city": "涞源"
  },
  {
    "cityid": 101090210,
    "city": "望都"
  },
  {
    "cityid": 101090211,
    "city": "安新"
  },
  {
    "cityid": 101090212,
    "city": "易县"
  },
  {
    "cityid": 101090214,
    "city": "曲阳"
  },
  {
    "cityid": 101090215,
    "city": "蠡县"
  },
  {
    "cityid": 101090216,
    "city": "顺平"
  },
  {
    "cityid": 101090217,
    "city": "雄县"
  },
  {
    "cityid": 101090218,
    "city": "涿州"
  },
  {
    "cityid": 101090219,
    "city": "定州"
  },
  {
    "cityid": 101090220,
    "city": "安国"
  },
  {
    "cityid": 101090221,
    "city": "高碑店"
  },
  {
    "cityid": 101090222,
    "city": "涞水"
  },
  {
    "cityid": 101090223,
    "city": "定兴"
  },
  {
    "cityid": 101090224,
    "city": "清苑"
  },
  {
    "cityid": 101090225,
    "city": "博野"
  },
  {
    "cityid": 101090301,
    "city": "张家口"
  },
  {
    "cityid": 101090302,
    "city": "宣化"
  },
  {
    "cityid": 101090303,
    "city": "张北"
  },
  {
    "cityid": 101090304,
    "city": "康保"
  },
  {
    "cityid": 101090305,
    "city": "沽源"
  },
  {
    "cityid": 101090306,
    "city": "尚义"
  },
  {
    "cityid": 101090307,
    "city": "蔚县"
  },
  {
    "cityid": 101090308,
    "city": "阳原"
  },
  {
    "cityid": 101090309,
    "city": "怀安"
  },
  {
    "cityid": 101090310,
    "city": "万全"
  },
  {
    "cityid": 101090311,
    "city": "怀来"
  },
  {
    "cityid": 101090312,
    "city": "涿鹿"
  },
  {
    "cityid": 101090313,
    "city": "赤城"
  },
  {
    "cityid": 101090314,
    "city": "崇礼"
  },
  {
    "cityid": 101090402,
    "city": "承德"
  },
  {
    "cityid": 101090403,
    "city": "承德县"
  },
  {
    "cityid": 101090404,
    "city": "兴隆"
  },
  {
    "cityid": 101090405,
    "city": "平泉"
  },
  {
    "cityid": 101090406,
    "city": "滦平"
  },
  {
    "cityid": 101090407,
    "city": "隆化"
  },
  {
    "cityid": 101090408,
    "city": "丰宁"
  },
  {
    "cityid": 101090409,
    "city": "宽城"
  },
  {
    "cityid": 101090410,
    "city": "围场"
  },
  {
    "cityid": 101090501,
    "city": "唐山"
  },
  {
    "cityid": 101090502,
    "city": "丰南"
  },
  {
    "cityid": 101090503,
    "city": "丰润"
  },
  {
    "cityid": 101090504,
    "city": "滦县"
  },
  {
    "cityid": 101090505,
    "city": "滦南"
  },
  {
    "cityid": 101090506,
    "city": "乐亭"
  },
  {
    "cityid": 101090507,
    "city": "迁西"
  },
  {
    "cityid": 101090508,
    "city": "玉田"
  },
  {
    "cityid": 101090509,
    "city": "唐海"
  },
  {
    "cityid": 101090510,
    "city": "遵化"
  },
  {
    "cityid": 101090511,
    "city": "迁安"
  },
  {
    "cityid": 101090512,
    "city": "曹妃甸"
  },
  {
    "cityid": 101090601,
    "city": "廊坊"
  },
  {
    "cityid": 101090602,
    "city": "固安"
  },
  {
    "cityid": 101090603,
    "city": "永清"
  },
  {
    "cityid": 101090604,
    "city": "香河"
  },
  {
    "cityid": 101090605,
    "city": "大城"
  },
  {
    "cityid": 101090606,
    "city": "文安"
  },
  {
    "cityid": 101090607,
    "city": "大厂"
  },
  {
    "cityid": 101090608,
    "city": "霸州"
  },
  {
    "cityid": 101090609,
    "city": "三河"
  },
  {
    "cityid": 101090701,
    "city": "沧州"
  },
  {
    "cityid": 101090702,
    "city": "青县"
  },
  {
    "cityid": 101090703,
    "city": "东光"
  },
  {
    "cityid": 101090704,
    "city": "海兴"
  },
  {
    "cityid": 101090705,
    "city": "盐山"
  },
  {
    "cityid": 101090706,
    "city": "肃宁"
  },
  {
    "cityid": 101090707,
    "city": "南皮"
  },
  {
    "cityid": 101090708,
    "city": "吴桥"
  },
  {
    "cityid": 101090709,
    "city": "献县"
  },
  {
    "cityid": 101090710,
    "city": "孟村"
  },
  {
    "cityid": 101090711,
    "city": "泊头"
  },
  {
    "cityid": 101090712,
    "city": "任丘"
  },
  {
    "cityid": 101090713,
    "city": "黄骅"
  },
  {
    "cityid": 101090714,
    "city": "河间"
  },
  {
    "cityid": 101090716,
    "city": "沧县"
  },
  {
    "cityid": 101090801,
    "city": "衡水"
  },
  {
    "cityid": 101090802,
    "city": "枣强"
  },
  {
    "cityid": 101090803,
    "city": "武邑"
  },
  {
    "cityid": 101090804,
    "city": "武强"
  },
  {
    "cityid": 101090805,
    "city": "饶阳"
  },
  {
    "cityid": 101090806,
    "city": "安平"
  },
  {
    "cityid": 101090807,
    "city": "故城"
  },
  {
    "cityid": 101090808,
    "city": "景县"
  },
  {
    "cityid": 101090809,
    "city": "阜城"
  },
  {
    "cityid": 101090810,
    "city": "冀州"
  },
  {
    "cityid": 101090811,
    "city": "深州"
  },
  {
    "cityid": 101090901,
    "city": "邢台"
  },
  {
    "cityid": 101090902,
    "city": "临城"
  },
  {
    "cityid": 101090904,
    "city": "内丘"
  },
  {
    "cityid": 101090905,
    "city": "柏乡"
  },
  {
    "cityid": 101090906,
    "city": "隆尧"
  },
  {
    "cityid": 101090907,
    "city": "南和"
  },
  {
    "cityid": 101090908,
    "city": "宁晋"
  },
  {
    "cityid": 101090909,
    "city": "巨鹿"
  },
  {
    "cityid": 101090910,
    "city": "新河"
  },
  {
    "cityid": 101090911,
    "city": "广宗"
  },
  {
    "cityid": 101090912,
    "city": "平乡"
  },
  {
    "cityid": 101090913,
    "city": "威县"
  },
  {
    "cityid": 101090914,
    "city": "清河"
  },
  {
    "cityid": 101090915,
    "city": "临西"
  },
  {
    "cityid": 101090916,
    "city": "南宫"
  },
  {
    "cityid": 101090917,
    "city": "沙河"
  },
  {
    "cityid": 101090918,
    "city": "任县"
  },
  {
    "cityid": 101091001,
    "city": "邯郸"
  },
  {
    "cityid": 101091002,
    "city": "峰峰"
  },
  {
    "cityid": 101091003,
    "city": "临漳"
  },
  {
    "cityid": 101091004,
    "city": "成安"
  },
  {
    "cityid": 101091005,
    "city": "大名"
  },
  {
    "cityid": 101091006,
    "city": "涉县"
  },
  {
    "cityid": 101091007,
    "city": "磁县"
  },
  {
    "cityid": 101091008,
    "city": "肥乡"
  },
  {
    "cityid": 101091009,
    "city": "永年"
  },
  {
    "cityid": 101091010,
    "city": "邱县"
  },
  {
    "cityid": 101091011,
    "city": "鸡泽"
  },
  {
    "cityid": 101091012,
    "city": "广平"
  },
  {
    "cityid": 101091013,
    "city": "馆陶"
  },
  {
    "cityid": 101091014,
    "city": "魏县"
  },
  {
    "cityid": 101091015,
    "city": "曲周"
  },
  {
    "cityid": 101091016,
    "city": "武安"
  },
  {
    "cityid": 101091101,
    "city": "秦皇岛"
  },
  {
    "cityid": 101091102,
    "city": "青龙"
  },
  {
    "cityid": 101091103,
    "city": "昌黎"
  },
  {
    "cityid": 101091104,
    "city": "抚宁"
  },
  {
    "cityid": 101091105,
    "city": "卢龙"
  },
  {
    "cityid": 101091106,
    "city": "北戴河"
  },
  {
    "cityid": 101100101,
    "city": "太原"
  },
  {
    "cityid": 101100102,
    "city": "清徐"
  },
  {
    "cityid": 101100103,
    "city": "阳曲"
  },
  {
    "cityid": 101100104,
    "city": "娄烦"
  },
  {
    "cityid": 101100105,
    "city": "古交"
  },
  {
    "cityid": 101100106,
    "city": "尖草坪区"
  },
  {
    "cityid": 101100107,
    "city": "小店区"
  },
  {
    "cityid": 101100201,
    "city": "大同"
  },
  {
    "cityid": 101100202,
    "city": "阳高"
  },
  {
    "cityid": 101100203,
    "city": "大同县"
  },
  {
    "cityid": 101100204,
    "city": "天镇"
  },
  {
    "cityid": 101100205,
    "city": "广灵"
  },
  {
    "cityid": 101100206,
    "city": "灵丘"
  },
  {
    "cityid": 101100207,
    "city": "浑源"
  },
  {
    "cityid": 101100208,
    "city": "左云"
  },
  {
    "cityid": 101100301,
    "city": "阳泉"
  },
  {
    "cityid": 101100302,
    "city": "盂县"
  },
  {
    "cityid": 101100303,
    "city": "平定"
  },
  {
    "cityid": 101100401,
    "city": "晋中"
  },
  {
    "cityid": 101100402,
    "city": "榆次"
  },
  {
    "cityid": 101100403,
    "city": "榆社"
  },
  {
    "cityid": 101100404,
    "city": "左权"
  },
  {
    "cityid": 101100405,
    "city": "和顺"
  },
  {
    "cityid": 101100406,
    "city": "昔阳"
  },
  {
    "cityid": 101100407,
    "city": "寿阳"
  },
  {
    "cityid": 101100408,
    "city": "太谷"
  },
  {
    "cityid": 101100409,
    "city": "祁县"
  },
  {
    "cityid": 101100410,
    "city": "平遥"
  },
  {
    "cityid": 101100411,
    "city": "灵石"
  },
  {
    "cityid": 101100412,
    "city": "介休"
  },
  {
    "cityid": 101100501,
    "city": "长治"
  },
  {
    "cityid": 101100502,
    "city": "黎城"
  },
  {
    "cityid": 101100503,
    "city": "屯留"
  },
  {
    "cityid": 101100504,
    "city": "潞城"
  },
  {
    "cityid": 101100505,
    "city": "襄垣"
  },
  {
    "cityid": 101100506,
    "city": "平顺"
  },
  {
    "cityid": 101100507,
    "city": "武乡"
  },
  {
    "cityid": 101100508,
    "city": "沁县"
  },
  {
    "cityid": 101100509,
    "city": "长子"
  },
  {
    "cityid": 101100510,
    "city": "沁源"
  },
  {
    "cityid": 101100511,
    "city": "壶关"
  },
  {
    "cityid": 101100601,
    "city": "晋城"
  },
  {
    "cityid": 101100602,
    "city": "沁水"
  },
  {
    "cityid": 101100603,
    "city": "阳城"
  },
  {
    "cityid": 101100604,
    "city": "陵川"
  },
  {
    "cityid": 101100605,
    "city": "高平"
  },
  {
    "cityid": 101100606,
    "city": "泽州"
  },
  {
    "cityid": 101100701,
    "city": "临汾"
  },
  {
    "cityid": 101100702,
    "city": "曲沃"
  },
  {
    "cityid": 101100703,
    "city": "永和"
  },
  {
    "cityid": 101100704,
    "city": "隰县"
  },
  {
    "cityid": 101100705,
    "city": "大宁"
  },
  {
    "cityid": 101100706,
    "city": "吉县"
  },
  {
    "cityid": 101100707,
    "city": "襄汾"
  },
  {
    "cityid": 101100708,
    "city": "蒲县"
  },
  {
    "cityid": 101100709,
    "city": "汾西"
  },
  {
    "cityid": 101100710,
    "city": "洪洞"
  },
  {
    "cityid": 101100711,
    "city": "霍州"
  },
  {
    "cityid": 101100712,
    "city": "乡宁"
  },
  {
    "cityid": 101100713,
    "city": "翼城"
  },
  {
    "cityid": 101100714,
    "city": "侯马"
  },
  {
    "cityid": 101100715,
    "city": "浮山"
  },
  {
    "cityid": 101100716,
    "city": "安泽"
  },
  {
    "cityid": 101100717,
    "city": "古县"
  },
  {
    "cityid": 101100801,
    "city": "运城"
  },
  {
    "cityid": 101100802,
    "city": "临猗"
  },
  {
    "cityid": 101100803,
    "city": "稷山"
  },
  {
    "cityid": 101100804,
    "city": "万荣"
  },
  {
    "cityid": 101100805,
    "city": "河津"
  },
  {
    "cityid": 101100806,
    "city": "新绛"
  },
  {
    "cityid": 101100807,
    "city": "绛县"
  },
  {
    "cityid": 101100808,
    "city": "闻喜"
  },
  {
    "cityid": 101100809,
    "city": "垣曲"
  },
  {
    "cityid": 101100810,
    "city": "永济"
  },
  {
    "cityid": 101100811,
    "city": "芮城"
  },
  {
    "cityid": 101100812,
    "city": "夏县"
  },
  {
    "cityid": 101100813,
    "city": "平陆"
  },
  {
    "cityid": 101100901,
    "city": "朔州"
  },
  {
    "cityid": 101100902,
    "city": "平鲁"
  },
  {
    "cityid": 101100903,
    "city": "山阴"
  },
  {
    "cityid": 101100904,
    "city": "右玉"
  },
  {
    "cityid": 101100905,
    "city": "应县"
  },
  {
    "cityid": 101100906,
    "city": "怀仁"
  },
  {
    "cityid": 101101001,
    "city": "忻州"
  },
  {
    "cityid": 101101002,
    "city": "定襄"
  },
  {
    "cityid": 101101003,
    "city": "五台县"
  },
  {
    "cityid": 101101004,
    "city": "河曲"
  },
  {
    "cityid": 101101005,
    "city": "偏关"
  },
  {
    "cityid": 101101006,
    "city": "神池"
  },
  {
    "cityid": 101101007,
    "city": "宁武"
  },
  {
    "cityid": 101101008,
    "city": "代县"
  },
  {
    "cityid": 101101009,
    "city": "繁峙"
  },
  {
    "cityid": 101101010,
    "city": "五台山"
  },
  {
    "cityid": 101101011,
    "city": "保德"
  },
  {
    "cityid": 101101012,
    "city": "静乐"
  },
  {
    "cityid": 101101013,
    "city": "岢岚"
  },
  {
    "cityid": 101101014,
    "city": "五寨"
  },
  {
    "cityid": 101101015,
    "city": "原平"
  },
  {
    "cityid": 101101100,
    "city": "吕梁"
  },
  {
    "cityid": 101101101,
    "city": "离石"
  },
  {
    "cityid": 101101102,
    "city": "临县"
  },
  {
    "cityid": 101101103,
    "city": "兴县"
  },
  {
    "cityid": 101101104,
    "city": "岚县"
  },
  {
    "cityid": 101101105,
    "city": "柳林"
  },
  {
    "cityid": 101101106,
    "city": "石楼"
  },
  {
    "cityid": 101101107,
    "city": "方山"
  },
  {
    "cityid": 101101108,
    "city": "交口"
  },
  {
    "cityid": 101101109,
    "city": "中阳"
  },
  {
    "cityid": 101101110,
    "city": "孝义"
  },
  {
    "cityid": 101101111,
    "city": "汾阳"
  },
  {
    "cityid": 101101112,
    "city": "文水"
  },
  {
    "cityid": 101101113,
    "city": "交城"
  },
  {
    "cityid": 101110101,
    "city": "西安"
  },
  {
    "cityid": 101110102,
    "city": "长安"
  },
  {
    "cityid": 101110103,
    "city": "临潼"
  },
  {
    "cityid": 101110104,
    "city": "蓝田"
  },
  {
    "cityid": 101110105,
    "city": "周至"
  },
  {
    "cityid": 101110106,
    "city": "户县"
  },
  {
    "cityid": 101110107,
    "city": "高陵"
  },
  {
    "cityid": 101110200,
    "city": "咸阳"
  },
  {
    "cityid": 101110201,
    "city": "三原"
  },
  {
    "cityid": 101110202,
    "city": "礼泉"
  },
  {
    "cityid": 101110203,
    "city": "永寿"
  },
  {
    "cityid": 101110204,
    "city": "淳化"
  },
  {
    "cityid": 101110205,
    "city": "泾阳"
  },
  {
    "cityid": 101110206,
    "city": "武功"
  },
  {
    "cityid": 101110207,
    "city": "乾县"
  },
  {
    "cityid": 101110208,
    "city": "彬县"
  },
  {
    "cityid": 101110209,
    "city": "长武"
  },
  {
    "cityid": 101110210,
    "city": "旬邑"
  },
  {
    "cityid": 101110211,
    "city": "兴平"
  },
  {
    "cityid": 101110300,
    "city": "延安"
  },
  {
    "cityid": 101110301,
    "city": "延长"
  },
  {
    "cityid": 101110302,
    "city": "延川"
  },
  {
    "cityid": 101110303,
    "city": "子长"
  },
  {
    "cityid": 101110304,
    "city": "宜川"
  },
  {
    "cityid": 101110305,
    "city": "富县"
  },
  {
    "cityid": 101110306,
    "city": "志丹"
  },
  {
    "cityid": 101110307,
    "city": "安塞"
  },
  {
    "cityid": 101110308,
    "city": "甘泉"
  },
  {
    "cityid": 101110309,
    "city": "洛川"
  },
  {
    "cityid": 101110310,
    "city": "黄陵"
  },
  {
    "cityid": 101110311,
    "city": "黄龙"
  },
  {
    "cityid": 101110312,
    "city": "吴起"
  },
  {
    "cityid": 101110401,
    "city": "榆林"
  },
  {
    "cityid": 101110402,
    "city": "府谷"
  },
  {
    "cityid": 101110403,
    "city": "神木"
  },
  {
    "cityid": 101110404,
    "city": "佳县"
  },
  {
    "cityid": 101110405,
    "city": "定边"
  },
  {
    "cityid": 101110406,
    "city": "靖边"
  },
  {
    "cityid": 101110407,
    "city": "横山"
  },
  {
    "cityid": 101110408,
    "city": "米脂"
  },
  {
    "cityid": 101110409,
    "city": "子洲"
  },
  {
    "cityid": 101110410,
    "city": "绥德"
  },
  {
    "cityid": 101110411,
    "city": "吴堡"
  },
  {
    "cityid": 101110412,
    "city": "清涧"
  },
  {
    "cityid": 101110413,
    "city": "榆阳"
  },
  {
    "cityid": 101110501,
    "city": "渭南"
  },
  {
    "cityid": 101110502,
    "city": "华县"
  },
  {
    "cityid": 101110503,
    "city": "潼关"
  },
  {
    "cityid": 101110504,
    "city": "大荔"
  },
  {
    "cityid": 101110505,
    "city": "白水"
  },
  {
    "cityid": 101110506,
    "city": "富平"
  },
  {
    "cityid": 101110507,
    "city": "蒲城"
  },
  {
    "cityid": 101110508,
    "city": "澄城"
  },
  {
    "cityid": 101110509,
    "city": "合阳"
  },
  {
    "cityid": 101110510,
    "city": "韩城"
  },
  {
    "cityid": 101110511,
    "city": "华阴"
  },
  {
    "cityid": 101110601,
    "city": "商洛"
  },
  {
    "cityid": 101110602,
    "city": "洛南"
  },
  {
    "cityid": 101110603,
    "city": "柞水"
  },
  {
    "cityid": 101110604,
    "city": "商州"
  },
  {
    "cityid": 101110605,
    "city": "镇安"
  },
  {
    "cityid": 101110606,
    "city": "丹凤"
  },
  {
    "cityid": 101110607,
    "city": "商南"
  },
  {
    "cityid": 101110608,
    "city": "山阳"
  },
  {
    "cityid": 101110701,
    "city": "安康"
  },
  {
    "cityid": 101110702,
    "city": "紫阳"
  },
  {
    "cityid": 101110703,
    "city": "石泉"
  },
  {
    "cityid": 101110704,
    "city": "汉阴"
  },
  {
    "cityid": 101110705,
    "city": "旬阳"
  },
  {
    "cityid": 101110706,
    "city": "岚皋"
  },
  {
    "cityid": 101110707,
    "city": "平利"
  },
  {
    "cityid": 101110708,
    "city": "白河"
  },
  {
    "cityid": 101110709,
    "city": "镇坪"
  },
  {
    "cityid": 101110710,
    "city": "宁陕"
  },
  {
    "cityid": 101110801,
    "city": "汉中"
  },
  {
    "cityid": 101110802,
    "city": "略阳"
  },
  {
    "cityid": 101110803,
    "city": "勉县"
  },
  {
    "cityid": 101110804,
    "city": "留坝"
  },
  {
    "cityid": 101110805,
    "city": "洋县"
  },
  {
    "cityid": 101110806,
    "city": "城固"
  },
  {
    "cityid": 101110807,
    "city": "西乡"
  },
  {
    "cityid": 101110808,
    "city": "佛坪"
  },
  {
    "cityid": 101110809,
    "city": "宁强"
  },
  {
    "cityid": 101110810,
    "city": "南郑"
  },
  {
    "cityid": 101110811,
    "city": "镇巴"
  },
  {
    "cityid": 101110901,
    "city": "宝鸡"
  },
  {
    "cityid": 101110903,
    "city": "千阳"
  },
  {
    "cityid": 101110904,
    "city": "麟游"
  },
  {
    "cityid": 101110905,
    "city": "岐山"
  },
  {
    "cityid": 101110906,
    "city": "凤翔"
  },
  {
    "cityid": 101110907,
    "city": "扶风"
  },
  {
    "cityid": 101110908,
    "city": "眉县"
  },
  {
    "cityid": 101110909,
    "city": "太白"
  },
  {
    "cityid": 101110910,
    "city": "凤县"
  },
  {
    "cityid": 101110911,
    "city": "陇县"
  },
  {
    "cityid": 101110912,
    "city": "陈仓"
  },
  {
    "cityid": 101111001,
    "city": "铜川"
  },
  {
    "cityid": 101111002,
    "city": "耀县"
  },
  {
    "cityid": 101111003,
    "city": "宜君"
  },
  {
    "cityid": 101111004,
    "city": "耀州"
  },
  {
    "cityid": 101111101,
    "city": "杨凌"
  },
  {
    "cityid": 101120101,
    "city": "济南"
  },
  {
    "cityid": 101120102,
    "city": "长清"
  },
  {
    "cityid": 101120103,
    "city": "商河"
  },
  {
    "cityid": 101120104,
    "city": "章丘"
  },
  {
    "cityid": 101120105,
    "city": "平阴"
  },
  {
    "cityid": 101120106,
    "city": "济阳"
  },
  {
    "cityid": 101120201,
    "city": "青岛"
  },
  {
    "cityid": 101120202,
    "city": "崂山"
  },
  {
    "cityid": 101120204,
    "city": "即墨"
  },
  {
    "cityid": 101120205,
    "city": "胶州"
  },
  {
    "cityid": 101120206,
    "city": "黄岛"
  },
  {
    "cityid": 101120207,
    "city": "莱西"
  },
  {
    "cityid": 101120208,
    "city": "平度"
  },
  {
    "cityid": 101120301,
    "city": "淄博"
  },
  {
    "cityid": 101120302,
    "city": "淄川"
  },
  {
    "cityid": 101120303,
    "city": "博山"
  },
  {
    "cityid": 101120304,
    "city": "高青"
  },
  {
    "cityid": 101120305,
    "city": "周村"
  },
  {
    "cityid": 101120306,
    "city": "沂源"
  },
  {
    "cityid": 101120307,
    "city": "桓台"
  },
  {
    "cityid": 101120308,
    "city": "临淄"
  },
  {
    "cityid": 101120401,
    "city": "德州"
  },
  {
    "cityid": 101120402,
    "city": "武城"
  },
  {
    "cityid": 101120403,
    "city": "临邑"
  },
  {
    "cityid": 101120404,
    "city": "陵县"
  },
  {
    "cityid": 101120405,
    "city": "齐河"
  },
  {
    "cityid": 101120406,
    "city": "乐陵"
  },
  {
    "cityid": 101120407,
    "city": "庆云"
  },
  {
    "cityid": 101120408,
    "city": "平原"
  },
  {
    "cityid": 101120409,
    "city": "宁津"
  },
  {
    "cityid": 101120410,
    "city": "夏津"
  },
  {
    "cityid": 101120411,
    "city": "禹城"
  },
  {
    "cityid": 101120501,
    "city": "烟台"
  },
  {
    "cityid": 101120502,
    "city": "莱州"
  },
  {
    "cityid": 101120503,
    "city": "长岛"
  },
  {
    "cityid": 101120504,
    "city": "蓬莱"
  },
  {
    "cityid": 101120505,
    "city": "龙口"
  },
  {
    "cityid": 101120506,
    "city": "招远"
  },
  {
    "cityid": 101120507,
    "city": "栖霞"
  },
  {
    "cityid": 101120508,
    "city": "福山"
  },
  {
    "cityid": 101120509,
    "city": "牟平"
  },
  {
    "cityid": 101120510,
    "city": "莱阳"
  },
  {
    "cityid": 101120511,
    "city": "海阳"
  },
  {
    "cityid": 101120601,
    "city": "潍坊"
  },
  {
    "cityid": 101120602,
    "city": "青州"
  },
  {
    "cityid": 101120603,
    "city": "寿光"
  },
  {
    "cityid": 101120604,
    "city": "临朐"
  },
  {
    "cityid": 101120605,
    "city": "昌乐"
  },
  {
    "cityid": 101120606,
    "city": "昌邑"
  },
  {
    "cityid": 101120607,
    "city": "安丘"
  },
  {
    "cityid": 101120608,
    "city": "高密"
  },
  {
    "cityid": 101120609,
    "city": "诸城"
  },
  {
    "cityid": 101120701,
    "city": "济宁"
  },
  {
    "cityid": 101120702,
    "city": "嘉祥"
  },
  {
    "cityid": 101120703,
    "city": "微山"
  },
  {
    "cityid": 101120704,
    "city": "鱼台"
  },
  {
    "cityid": 101120705,
    "city": "兖州"
  },
  {
    "cityid": 101120706,
    "city": "金乡"
  },
  {
    "cityid": 101120707,
    "city": "汶上"
  },
  {
    "cityid": 101120708,
    "city": "泗水"
  },
  {
    "cityid": 101120709,
    "city": "梁山"
  },
  {
    "cityid": 101120710,
    "city": "曲阜"
  },
  {
    "cityid": 101120711,
    "city": "邹城"
  },
  {
    "cityid": 101120801,
    "city": "泰安"
  },
  {
    "cityid": 101120802,
    "city": "新泰"
  },
  {
    "cityid": 101120804,
    "city": "肥城"
  },
  {
    "cityid": 101120805,
    "city": "东平"
  },
  {
    "cityid": 101120806,
    "city": "宁阳"
  },
  {
    "cityid": 101120901,
    "city": "临沂"
  },
  {
    "cityid": 101120902,
    "city": "莒南"
  },
  {
    "cityid": 101120903,
    "city": "沂南"
  },
  {
    "cityid": 101120904,
    "city": "兰陵"
  },
  {
    "cityid": 101120905,
    "city": "临沭"
  },
  {
    "cityid": 101120906,
    "city": "郯城"
  },
  {
    "cityid": 101120907,
    "city": "蒙阴"
  },
  {
    "cityid": 101120908,
    "city": "平邑"
  },
  {
    "cityid": 101120909,
    "city": "费县"
  },
  {
    "cityid": 101120910,
    "city": "沂水"
  },
  {
    "cityid": 101121001,
    "city": "菏泽"
  },
  {
    "cityid": 101121002,
    "city": "鄄城"
  },
  {
    "cityid": 101121003,
    "city": "郓城"
  },
  {
    "cityid": 101121004,
    "city": "东明"
  },
  {
    "cityid": 101121005,
    "city": "定陶"
  },
  {
    "cityid": 101121006,
    "city": "巨野"
  },
  {
    "cityid": 101121007,
    "city": "曹县"
  },
  {
    "cityid": 101121008,
    "city": "成武"
  },
  {
    "cityid": 101121009,
    "city": "单县"
  },
  {
    "cityid": 101121101,
    "city": "滨州"
  },
  {
    "cityid": 101121102,
    "city": "博兴"
  },
  {
    "cityid": 101121103,
    "city": "无棣"
  },
  {
    "cityid": 101121104,
    "city": "阳信"
  },
  {
    "cityid": 101121105,
    "city": "惠民"
  },
  {
    "cityid": 101121106,
    "city": "沾化"
  },
  {
    "cityid": 101121107,
    "city": "邹平"
  },
  {
    "cityid": 101121201,
    "city": "东营"
  },
  {
    "cityid": 101121202,
    "city": "河口"
  },
  {
    "cityid": 101121203,
    "city": "垦利"
  },
  {
    "cityid": 101121204,
    "city": "利津"
  },
  {
    "cityid": 101121205,
    "city": "广饶"
  },
  {
    "cityid": 101121301,
    "city": "威海"
  },
  {
    "cityid": 101121302,
    "city": "文登"
  },
  {
    "cityid": 101121303,
    "city": "荣成"
  },
  {
    "cityid": 101121304,
    "city": "乳山"
  },
  {
    "cityid": 101121305,
    "city": "成山头"
  },
  {
    "cityid": 101121306,
    "city": "石岛"
  },
  {
    "cityid": 101121401,
    "city": "枣庄"
  },
  {
    "cityid": 101121402,
    "city": "薛城"
  },
  {
    "cityid": 101121403,
    "city": "峄城"
  },
  {
    "cityid": 101121404,
    "city": "台儿庄"
  },
  {
    "cityid": 101121405,
    "city": "滕州"
  },
  {
    "cityid": 101121501,
    "city": "日照"
  },
  {
    "cityid": 101121502,
    "city": "五莲"
  },
  {
    "cityid": 101121503,
    "city": "莒县"
  },
  {
    "cityid": 101121601,
    "city": "莱芜"
  },
  {
    "cityid": 101121701,
    "city": "聊城"
  },
  {
    "cityid": 101121702,
    "city": "冠县"
  },
  {
    "cityid": 101121703,
    "city": "阳谷"
  },
  {
    "cityid": 101121704,
    "city": "高唐"
  },
  {
    "cityid": 101121705,
    "city": "茌平"
  },
  {
    "cityid": 101121706,
    "city": "东阿"
  },
  {
    "cityid": 101121707,
    "city": "临清"
  },
  {
    "cityid": 101121709,
    "city": "莘县"
  },
  {
    "cityid": 101130101,
    "city": "乌鲁木齐"
  },
  {
    "cityid": 101130103,
    "city": "小渠子"
  },
  {
    "cityid": 101130105,
    "city": "达坂城"
  },
  {
    "cityid": 101130108,
    "city": "乌鲁木齐牧试站"
  },
  {
    "cityid": 101130109,
    "city": "天池"
  },
  {
    "cityid": 101130110,
    "city": "白杨沟"
  },
  {
    "cityid": 101130201,
    "city": "克拉玛依"
  },
  {
    "cityid": 101130202,
    "city": "乌尔禾"
  },
  {
    "cityid": 101130203,
    "city": "白碱滩"
  },
  {
    "cityid": 101130301,
    "city": "石河子"
  },
  {
    "cityid": 101130302,
    "city": "炮台"
  },
  {
    "cityid": 101130303,
    "city": "莫索湾"
  },
  {
    "cityid": 101130401,
    "city": "昌吉"
  },
  {
    "cityid": 101130402,
    "city": "呼图壁"
  },
  {
    "cityid": 101130403,
    "city": "米泉"
  },
  {
    "cityid": 101130404,
    "city": "阜康"
  },
  {
    "cityid": 101130405,
    "city": "吉木萨尔"
  },
  {
    "cityid": 101130406,
    "city": "奇台"
  },
  {
    "cityid": 101130407,
    "city": "玛纳斯"
  },
  {
    "cityid": 101130408,
    "city": "木垒"
  },
  {
    "cityid": 101130409,
    "city": "蔡家湖"
  },
  {
    "cityid": 101130501,
    "city": "吐鲁番"
  },
  {
    "cityid": 101130502,
    "city": "托克逊"
  },
  {
    "cityid": 101130504,
    "city": "鄯善"
  },
  {
    "cityid": 101130601,
    "city": "库尔勒"
  },
  {
    "cityid": 101130602,
    "city": "轮台"
  },
  {
    "cityid": 101130603,
    "city": "尉犁"
  },
  {
    "cityid": 101130604,
    "city": "若羌"
  },
  {
    "cityid": 101130605,
    "city": "且末"
  },
  {
    "cityid": 101130606,
    "city": "和静"
  },
  {
    "cityid": 101130607,
    "city": "焉耆"
  },
  {
    "cityid": 101130608,
    "city": "和硕"
  },
  {
    "cityid": 101130610,
    "city": "巴音布鲁克"
  },
  {
    "cityid": 101130611,
    "city": "铁干里克"
  },
  {
    "cityid": 101130612,
    "city": "博湖"
  },
  {
    "cityid": 101130613,
    "city": "塔中"
  },
  {
    "cityid": 101130614,
    "city": "巴仑台"
  },
  {
    "cityid": 101130701,
    "city": "阿拉尔"
  },
  {
    "cityid": 101130801,
    "city": "阿克苏"
  },
  {
    "cityid": 101130802,
    "city": "乌什"
  },
  {
    "cityid": 101130803,
    "city": "温宿"
  },
  {
    "cityid": 101130804,
    "city": "拜城"
  },
  {
    "cityid": 101130805,
    "city": "新和"
  },
  {
    "cityid": 101130806,
    "city": "沙雅"
  },
  {
    "cityid": 101130807,
    "city": "库车"
  },
  {
    "cityid": 101130808,
    "city": "柯坪"
  },
  {
    "cityid": 101130809,
    "city": "阿瓦提"
  },
  {
    "cityid": 101130901,
    "city": "喀什"
  },
  {
    "cityid": 101130902,
    "city": "英吉沙"
  },
  {
    "cityid": 101130903,
    "city": "塔什库尔干"
  },
  {
    "cityid": 101130904,
    "city": "麦盖提"
  },
  {
    "cityid": 101130905,
    "city": "莎车"
  },
  {
    "cityid": 101130906,
    "city": "叶城"
  },
  {
    "cityid": 101130907,
    "city": "泽普"
  },
  {
    "cityid": 101130908,
    "city": "巴楚"
  },
  {
    "cityid": 101130909,
    "city": "岳普湖"
  },
  {
    "cityid": 101130910,
    "city": "伽师"
  },
  {
    "cityid": 101130911,
    "city": "疏附"
  },
  {
    "cityid": 101130912,
    "city": "疏勒"
  },
  {
    "cityid": 101131001,
    "city": "伊宁"
  },
  {
    "cityid": 101131002,
    "city": "察布查尔"
  },
  {
    "cityid": 101131003,
    "city": "尼勒克"
  },
  {
    "cityid": 101131004,
    "city": "伊宁县"
  },
  {
    "cityid": 101131005,
    "city": "巩留"
  },
  {
    "cityid": 101131006,
    "city": "新源"
  },
  {
    "cityid": 101131007,
    "city": "昭苏"
  },
  {
    "cityid": 101131008,
    "city": "特克斯"
  },
  {
    "cityid": 101131009,
    "city": "霍城"
  },
  {
    "cityid": 101131010,
    "city": "霍尔果斯"
  },
  {
    "cityid": 101131011,
    "city": "奎屯"
  },
  {
    "cityid": 101131101,
    "city": "塔城"
  },
  {
    "cityid": 101131102,
    "city": "裕民"
  },
  {
    "cityid": 101131103,
    "city": "额敏"
  },
  {
    "cityid": 101131104,
    "city": "和布克赛尔"
  },
  {
    "cityid": 101131105,
    "city": "托里"
  },
  {
    "cityid": 101131106,
    "city": "乌苏"
  },
  {
    "cityid": 101131107,
    "city": "沙湾"
  },
  {
    "cityid": 101131201,
    "city": "哈密"
  },
  {
    "cityid": 101131203,
    "city": "巴里坤"
  },
  {
    "cityid": 101131204,
    "city": "伊吾"
  },
  {
    "cityid": 101131301,
    "city": "和田"
  },
  {
    "cityid": 101131302,
    "city": "皮山"
  },
  {
    "cityid": 101131303,
    "city": "策勒"
  },
  {
    "cityid": 101131304,
    "city": "墨玉"
  },
  {
    "cityid": 101131305,
    "city": "洛浦"
  },
  {
    "cityid": 101131306,
    "city": "民丰"
  },
  {
    "cityid": 101131307,
    "city": "于田"
  },
  {
    "cityid": 101131401,
    "city": "阿勒泰"
  },
  {
    "cityid": 101131402,
    "city": "哈巴河"
  },
  {
    "cityid": 101131405,
    "city": "吉木乃"
  },
  {
    "cityid": 101131406,
    "city": "布尔津"
  },
  {
    "cityid": 101131407,
    "city": "福海"
  },
  {
    "cityid": 101131408,
    "city": "富蕴"
  },
  {
    "cityid": 101131409,
    "city": "青河"
  },
  {
    "cityid": 101131501,
    "city": "阿图什"
  },
  {
    "cityid": 101131502,
    "city": "乌恰"
  },
  {
    "cityid": 101131503,
    "city": "阿克陶"
  },
  {
    "cityid": 101131504,
    "city": "阿合奇"
  },
  {
    "cityid": 101131601,
    "city": "博乐"
  },
  {
    "cityid": 101131602,
    "city": "温泉"
  },
  {
    "cityid": 101131603,
    "city": "精河"
  },
  {
    "cityid": 101131606,
    "city": "阿拉山口"
  },
  {
    "cityid": 101140101,
    "city": "拉萨"
  },
  {
    "cityid": 101140102,
    "city": "当雄"
  },
  {
    "cityid": 101140103,
    "city": "尼木"
  },
  {
    "cityid": 101140104,
    "city": "林周"
  },
  {
    "cityid": 101140105,
    "city": "堆龙德庆"
  },
  {
    "cityid": 101140106,
    "city": "曲水"
  },
  {
    "cityid": 101140107,
    "city": "达孜"
  },
  {
    "cityid": 101140108,
    "city": "墨竹工卡"
  },
  {
    "cityid": 101140201,
    "city": "日喀则"
  },
  {
    "cityid": 101140202,
    "city": "拉孜"
  },
  {
    "cityid": 101140203,
    "city": "南木林"
  },
  {
    "cityid": 101140204,
    "city": "聂拉木"
  },
  {
    "cityid": 101140205,
    "city": "定日"
  },
  {
    "cityid": 101140206,
    "city": "江孜"
  },
  {
    "cityid": 101140207,
    "city": "帕里"
  },
  {
    "cityid": 101140208,
    "city": "仲巴"
  },
  {
    "cityid": 101140209,
    "city": "萨嘎"
  },
  {
    "cityid": 101140210,
    "city": "吉隆"
  },
  {
    "cityid": 101140211,
    "city": "昂仁"
  },
  {
    "cityid": 101140212,
    "city": "定结"
  },
  {
    "cityid": 101140213,
    "city": "萨迦"
  },
  {
    "cityid": 101140214,
    "city": "谢通门"
  },
  {
    "cityid": 101140216,
    "city": "岗巴"
  },
  {
    "cityid": 101140217,
    "city": "白朗"
  },
  {
    "cityid": 101140218,
    "city": "亚东"
  },
  {
    "cityid": 101140219,
    "city": "康马"
  },
  {
    "cityid": 101140220,
    "city": "仁布"
  },
  {
    "cityid": 101140301,
    "city": "山南"
  },
  {
    "cityid": 101140302,
    "city": "贡嘎"
  },
  {
    "cityid": 101140303,
    "city": "札囊"
  },
  {
    "cityid": 101140304,
    "city": "加查"
  },
  {
    "cityid": 101140305,
    "city": "浪卡子"
  },
  {
    "cityid": 101140306,
    "city": "错那"
  },
  {
    "cityid": 101140307,
    "city": "隆子"
  },
  {
    "cityid": 101140308,
    "city": "泽当"
  },
  {
    "cityid": 101140309,
    "city": "乃东"
  },
  {
    "cityid": 101140310,
    "city": "桑日"
  },
  {
    "cityid": 101140311,
    "city": "洛扎"
  },
  {
    "cityid": 101140312,
    "city": "措美"
  },
  {
    "cityid": 101140313,
    "city": "琼结"
  },
  {
    "cityid": 101140314,
    "city": "曲松"
  },
  {
    "cityid": 101140401,
    "city": "林芝"
  },
  {
    "cityid": 101140402,
    "city": "波密"
  },
  {
    "cityid": 101140403,
    "city": "米林"
  },
  {
    "cityid": 101140404,
    "city": "察隅"
  },
  {
    "cityid": 101140405,
    "city": "工布江达"
  },
  {
    "cityid": 101140406,
    "city": "朗县"
  },
  {
    "cityid": 101140407,
    "city": "墨脱"
  },
  {
    "cityid": 101140501,
    "city": "昌都"
  },
  {
    "cityid": 101140502,
    "city": "丁青"
  },
  {
    "cityid": 101140503,
    "city": "边坝"
  },
  {
    "cityid": 101140504,
    "city": "洛隆"
  },
  {
    "cityid": 101140505,
    "city": "左贡"
  },
  {
    "cityid": 101140506,
    "city": "芒康"
  },
  {
    "cityid": 101140507,
    "city": "类乌齐"
  },
  {
    "cityid": 101140508,
    "city": "八宿"
  },
  {
    "cityid": 101140509,
    "city": "江达"
  },
  {
    "cityid": 101140510,
    "city": "察雅"
  },
  {
    "cityid": 101140511,
    "city": "贡觉"
  },
  {
    "cityid": 101140601,
    "city": "那曲"
  },
  {
    "cityid": 101140602,
    "city": "尼玛"
  },
  {
    "cityid": 101140603,
    "city": "嘉黎"
  },
  {
    "cityid": 101140604,
    "city": "班戈"
  },
  {
    "cityid": 101140605,
    "city": "安多"
  },
  {
    "cityid": 101140606,
    "city": "索县"
  },
  {
    "cityid": 101140607,
    "city": "聂荣"
  },
  {
    "cityid": 101140608,
    "city": "巴青"
  },
  {
    "cityid": 101140609,
    "city": "比如"
  },
  {
    "cityid": 101140610,
    "city": "双湖"
  },
  {
    "cityid": 101140701,
    "city": "阿里"
  },
  {
    "cityid": 101140702,
    "city": "改则"
  },
  {
    "cityid": 101140703,
    "city": "申扎"
  },
  {
    "cityid": 101140704,
    "city": "狮泉河"
  },
  {
    "cityid": 101140705,
    "city": "普兰"
  },
  {
    "cityid": 101140706,
    "city": "札达"
  },
  {
    "cityid": 101140707,
    "city": "噶尔"
  },
  {
    "cityid": 101140708,
    "city": "日土"
  },
  {
    "cityid": 101140709,
    "city": "革吉"
  },
  {
    "cityid": 101140710,
    "city": "措勤"
  },
  {
    "cityid": 101150101,
    "city": "西宁"
  },
  {
    "cityid": 101150102,
    "city": "大通"
  },
  {
    "cityid": 101150103,
    "city": "湟源"
  },
  {
    "cityid": 101150104,
    "city": "湟中"
  },
  {
    "cityid": 101150201,
    "city": "海东"
  },
  {
    "cityid": 101150202,
    "city": "乐都"
  },
  {
    "cityid": 101150203,
    "city": "民和"
  },
  {
    "cityid": 101150204,
    "city": "互助"
  },
  {
    "cityid": 101150205,
    "city": "化隆"
  },
  {
    "cityid": 101150206,
    "city": "循化"
  },
  {
    "cityid": 101150207,
    "city": "冷湖"
  },
  {
    "cityid": 101150208,
    "city": "平安"
  },
  {
    "cityid": 101150301,
    "city": "黄南"
  },
  {
    "cityid": 101150302,
    "city": "尖扎"
  },
  {
    "cityid": 101150303,
    "city": "泽库"
  },
  {
    "cityid": 101150304,
    "city": "河南"
  },
  {
    "cityid": 101150305,
    "city": "同仁"
  },
  {
    "cityid": 101150401,
    "city": "海南"
  },
  {
    "cityid": 101150404,
    "city": "贵德"
  },
  {
    "cityid": 101150406,
    "city": "兴海"
  },
  {
    "cityid": 101150407,
    "city": "贵南"
  },
  {
    "cityid": 101150408,
    "city": "同德"
  },
  {
    "cityid": 101150409,
    "city": "共和"
  },
  {
    "cityid": 101150501,
    "city": "果洛"
  },
  {
    "cityid": 101150502,
    "city": "班玛"
  },
  {
    "cityid": 101150503,
    "city": "甘德"
  },
  {
    "cityid": 101150504,
    "city": "达日"
  },
  {
    "cityid": 101150505,
    "city": "久治"
  },
  {
    "cityid": 101150506,
    "city": "玛多"
  },
  {
    "cityid": 101150507,
    "city": "多县"
  },
  {
    "cityid": 101150508,
    "city": "玛沁"
  },
  {
    "cityid": 101150601,
    "city": "玉树"
  },
  {
    "cityid": 101150602,
    "city": "称多"
  },
  {
    "cityid": 101150603,
    "city": "治多"
  },
  {
    "cityid": 101150604,
    "city": "杂多"
  },
  {
    "cityid": 101150605,
    "city": "囊谦"
  },
  {
    "cityid": 101150606,
    "city": "曲麻莱"
  },
  {
    "cityid": 101150701,
    "city": "海西"
  },
  {
    "cityid": 101150708,
    "city": "天峻"
  },
  {
    "cityid": 101150709,
    "city": "乌兰"
  },
  {
    "cityid": 101150712,
    "city": "茫崖"
  },
  {
    "cityid": 101150713,
    "city": "大柴旦"
  },
  {
    "cityid": 101150716,
    "city": "德令哈"
  },
  {
    "cityid": 101150801,
    "city": "海北"
  },
  {
    "cityid": 101150802,
    "city": "门源"
  },
  {
    "cityid": 101150803,
    "city": "祁连"
  },
  {
    "cityid": 101150804,
    "city": "海晏"
  },
  {
    "cityid": 101150806,
    "city": "刚察"
  },
  {
    "cityid": 101150901,
    "city": "格尔木"
  },
  {
    "cityid": 101150902,
    "city": "都兰"
  },
  {
    "cityid": 101160101,
    "city": "兰州"
  },
  {
    "cityid": 101160102,
    "city": "皋兰"
  },
  {
    "cityid": 101160103,
    "city": "永登"
  },
  {
    "cityid": 101160104,
    "city": "榆中"
  },
  {
    "cityid": 101160201,
    "city": "定西"
  },
  {
    "cityid": 101160202,
    "city": "通渭"
  },
  {
    "cityid": 101160203,
    "city": "陇西"
  },
  {
    "cityid": 101160204,
    "city": "渭源"
  },
  {
    "cityid": 101160205,
    "city": "临洮"
  },
  {
    "cityid": 101160206,
    "city": "漳县"
  },
  {
    "cityid": 101160207,
    "city": "岷县"
  },
  {
    "cityid": 101160208,
    "city": "安定"
  },
  {
    "cityid": 101160301,
    "city": "平凉"
  },
  {
    "cityid": 101160302,
    "city": "泾川"
  },
  {
    "cityid": 101160303,
    "city": "灵台"
  },
  {
    "cityid": 101160304,
    "city": "崇信"
  },
  {
    "cityid": 101160305,
    "city": "华亭"
  },
  {
    "cityid": 101160306,
    "city": "庄浪"
  },
  {
    "cityid": 101160307,
    "city": "静宁"
  },
  {
    "cityid": 101160308,
    "city": "崆峒"
  },
  {
    "cityid": 101160401,
    "city": "庆阳"
  },
  {
    "cityid": 101160403,
    "city": "环县"
  },
  {
    "cityid": 101160404,
    "city": "华池"
  },
  {
    "cityid": 101160405,
    "city": "合水"
  },
  {
    "cityid": 101160406,
    "city": "正宁"
  },
  {
    "cityid": 101160407,
    "city": "宁县"
  },
  {
    "cityid": 101160408,
    "city": "镇原"
  },
  {
    "cityid": 101160409,
    "city": "庆城"
  },
  {
    "cityid": 101160501,
    "city": "武威"
  },
  {
    "cityid": 101160502,
    "city": "民勤"
  },
  {
    "cityid": 101160503,
    "city": "古浪"
  },
  {
    "cityid": 101160505,
    "city": "天祝"
  },
  {
    "cityid": 101160601,
    "city": "金昌"
  },
  {
    "cityid": 101160602,
    "city": "永昌"
  },
  {
    "cityid": 101160701,
    "city": "张掖"
  },
  {
    "cityid": 101160702,
    "city": "肃南"
  },
  {
    "cityid": 101160703,
    "city": "民乐"
  },
  {
    "cityid": 101160704,
    "city": "临泽"
  },
  {
    "cityid": 101160705,
    "city": "高台"
  },
  {
    "cityid": 101160706,
    "city": "山丹"
  },
  {
    "cityid": 101160801,
    "city": "酒泉"
  },
  {
    "cityid": 101160803,
    "city": "金塔"
  },
  {
    "cityid": 101160804,
    "city": "阿克塞"
  },
  {
    "cityid": 101160805,
    "city": "瓜州"
  },
  {
    "cityid": 101160806,
    "city": "肃北"
  },
  {
    "cityid": 101160807,
    "city": "玉门"
  },
  {
    "cityid": 101160808,
    "city": "敦煌"
  },
  {
    "cityid": 101160901,
    "city": "天水"
  },
  {
    "cityid": 101160903,
    "city": "清水"
  },
  {
    "cityid": 101160904,
    "city": "秦安"
  },
  {
    "cityid": 101160905,
    "city": "甘谷"
  },
  {
    "cityid": 101160906,
    "city": "武山"
  },
  {
    "cityid": 101160907,
    "city": "张家川"
  },
  {
    "cityid": 101160908,
    "city": "麦积"
  },
  {
    "cityid": 101161001,
    "city": "武都"
  },
  {
    "cityid": 101161002,
    "city": "成县"
  },
  {
    "cityid": 101161003,
    "city": "文县"
  },
  {
    "cityid": 101161004,
    "city": "宕昌"
  },
  {
    "cityid": 101161005,
    "city": "康县"
  },
  {
    "cityid": 101161006,
    "city": "西和"
  },
  {
    "cityid": 101161007,
    "city": "礼县"
  },
  {
    "cityid": 101161008,
    "city": "徽县"
  },
  {
    "cityid": 101161009,
    "city": "两当"
  },
  {
    "cityid": 101161101,
    "city": "临夏"
  },
  {
    "cityid": 101161102,
    "city": "康乐"
  },
  {
    "cityid": 101161103,
    "city": "永靖"
  },
  {
    "cityid": 101161104,
    "city": "广河"
  },
  {
    "cityid": 101161105,
    "city": "和政"
  },
  {
    "cityid": 101161106,
    "city": "东乡"
  },
  {
    "cityid": 101161107,
    "city": "积石山"
  },
  {
    "cityid": 101161201,
    "city": "合作"
  },
  {
    "cityid": 101161202,
    "city": "临潭"
  },
  {
    "cityid": 101161203,
    "city": "卓尼"
  },
  {
    "cityid": 101161204,
    "city": "舟曲"
  },
  {
    "cityid": 101161205,
    "city": "迭部"
  },
  {
    "cityid": 101161206,
    "city": "玛曲"
  },
  {
    "cityid": 101161207,
    "city": "碌曲"
  },
  {
    "cityid": 101161208,
    "city": "夏河"
  },
  {
    "cityid": 101161301,
    "city": "白银"
  },
  {
    "cityid": 101161302,
    "city": "靖远"
  },
  {
    "cityid": 101161303,
    "city": "会宁"
  },
  {
    "cityid": 101161304,
    "city": "平川"
  },
  {
    "cityid": 101161305,
    "city": "景泰"
  },
  {
    "cityid": 101161401,
    "city": "嘉峪关"
  },
  {
    "cityid": 101170101,
    "city": "银川"
  },
  {
    "cityid": 101170102,
    "city": "永宁"
  },
  {
    "cityid": 101170103,
    "city": "灵武"
  },
  {
    "cityid": 101170104,
    "city": "贺兰"
  },
  {
    "cityid": 101170201,
    "city": "石嘴山"
  },
  {
    "cityid": 101170202,
    "city": "惠农"
  },
  {
    "cityid": 101170203,
    "city": "平罗"
  },
  {
    "cityid": 101170204,
    "city": "陶乐"
  },
  {
    "cityid": 101170301,
    "city": "吴忠"
  },
  {
    "cityid": 101170302,
    "city": "同心"
  },
  {
    "cityid": 101170303,
    "city": "盐池"
  },
  {
    "cityid": 101170306,
    "city": "青铜峡"
  },
  {
    "cityid": 101170401,
    "city": "固原"
  },
  {
    "cityid": 101170402,
    "city": "西吉"
  },
  {
    "cityid": 101170403,
    "city": "隆德"
  },
  {
    "cityid": 101170404,
    "city": "泾源"
  },
  {
    "cityid": 101170406,
    "city": "彭阳"
  },
  {
    "cityid": 101170501,
    "city": "中卫"
  },
  {
    "cityid": 101170502,
    "city": "中宁"
  },
  {
    "cityid": 101170504,
    "city": "海原"
  },
  {
    "cityid": 101180101,
    "city": "郑州"
  },
  {
    "cityid": 101180102,
    "city": "巩义"
  },
  {
    "cityid": 101180103,
    "city": "荥阳"
  },
  {
    "cityid": 101180104,
    "city": "登封"
  },
  {
    "cityid": 101180105,
    "city": "新密"
  },
  {
    "cityid": 101180106,
    "city": "新郑"
  },
  {
    "cityid": 101180107,
    "city": "中牟"
  },
  {
    "cityid": 101180108,
    "city": "上街"
  },
  {
    "cityid": 101180201,
    "city": "安阳"
  },
  {
    "cityid": 101180202,
    "city": "汤阴"
  },
  {
    "cityid": 101180203,
    "city": "滑县"
  },
  {
    "cityid": 101180204,
    "city": "内黄"
  },
  {
    "cityid": 101180205,
    "city": "林州"
  },
  {
    "cityid": 101180301,
    "city": "新乡"
  },
  {
    "cityid": 101180302,
    "city": "获嘉"
  },
  {
    "cityid": 101180303,
    "city": "原阳"
  },
  {
    "cityid": 101180304,
    "city": "辉县"
  },
  {
    "cityid": 101180305,
    "city": "卫辉"
  },
  {
    "cityid": 101180306,
    "city": "延津"
  },
  {
    "cityid": 101180307,
    "city": "封丘"
  },
  {
    "cityid": 101180308,
    "city": "长垣"
  },
  {
    "cityid": 101180401,
    "city": "许昌"
  },
  {
    "cityid": 101180402,
    "city": "鄢陵"
  },
  {
    "cityid": 101180403,
    "city": "襄城"
  },
  {
    "cityid": 101180404,
    "city": "长葛"
  },
  {
    "cityid": 101180405,
    "city": "禹州"
  },
  {
    "cityid": 101180501,
    "city": "平顶山"
  },
  {
    "cityid": 101180502,
    "city": "郏县"
  },
  {
    "cityid": 101180503,
    "city": "宝丰"
  },
  {
    "cityid": 101180504,
    "city": "汝州"
  },
  {
    "cityid": 101180505,
    "city": "叶县"
  },
  {
    "cityid": 101180506,
    "city": "舞钢"
  },
  {
    "cityid": 101180507,
    "city": "鲁山"
  },
  {
    "cityid": 101180508,
    "city": "石龙"
  },
  {
    "cityid": 101180601,
    "city": "信阳"
  },
  {
    "cityid": 101180602,
    "city": "息县"
  },
  {
    "cityid": 101180603,
    "city": "罗山"
  },
  {
    "cityid": 101180604,
    "city": "光山"
  },
  {
    "cityid": 101180605,
    "city": "新县"
  },
  {
    "cityid": 101180606,
    "city": "淮滨"
  },
  {
    "cityid": 101180607,
    "city": "潢川"
  },
  {
    "cityid": 101180608,
    "city": "固始"
  },
  {
    "cityid": 101180609,
    "city": "商城"
  },
  {
    "cityid": 101180701,
    "city": "南阳"
  },
  {
    "cityid": 101180702,
    "city": "南召"
  },
  {
    "cityid": 101180703,
    "city": "方城"
  },
  {
    "cityid": 101180704,
    "city": "社旗"
  },
  {
    "cityid": 101180705,
    "city": "西峡"
  },
  {
    "cityid": 101180706,
    "city": "内乡"
  },
  {
    "cityid": 101180707,
    "city": "镇平"
  },
  {
    "cityid": 101180708,
    "city": "淅川"
  },
  {
    "cityid": 101180709,
    "city": "新野"
  },
  {
    "cityid": 101180710,
    "city": "唐河"
  },
  {
    "cityid": 101180711,
    "city": "邓州"
  },
  {
    "cityid": 101180712,
    "city": "桐柏"
  },
  {
    "cityid": 101180801,
    "city": "开封"
  },
  {
    "cityid": 101180802,
    "city": "杞县"
  },
  {
    "cityid": 101180803,
    "city": "尉氏"
  },
  {
    "cityid": 101180804,
    "city": "通许"
  },
  {
    "cityid": 101180805,
    "city": "兰考"
  },
  {
    "cityid": 101180901,
    "city": "洛阳"
  },
  {
    "cityid": 101180902,
    "city": "新安"
  },
  {
    "cityid": 101180903,
    "city": "孟津"
  },
  {
    "cityid": 101180904,
    "city": "宜阳"
  },
  {
    "cityid": 101180905,
    "city": "洛宁"
  },
  {
    "cityid": 101180906,
    "city": "伊川"
  },
  {
    "cityid": 101180907,
    "city": "嵩县"
  },
  {
    "cityid": 101180908,
    "city": "偃师"
  },
  {
    "cityid": 101180909,
    "city": "栾川"
  },
  {
    "cityid": 101180910,
    "city": "汝阳"
  },
  {
    "cityid": 101180911,
    "city": "吉利"
  },
  {
    "cityid": 101181001,
    "city": "商丘"
  },
  {
    "cityid": 101181003,
    "city": "睢县"
  },
  {
    "cityid": 101181004,
    "city": "民权"
  },
  {
    "cityid": 101181005,
    "city": "虞城"
  },
  {
    "cityid": 101181006,
    "city": "柘城"
  },
  {
    "cityid": 101181007,
    "city": "宁陵"
  },
  {
    "cityid": 101181008,
    "city": "夏邑"
  },
  {
    "cityid": 101181009,
    "city": "永城"
  },
  {
    "cityid": 101181101,
    "city": "焦作"
  },
  {
    "cityid": 101181102,
    "city": "修武"
  },
  {
    "cityid": 101181103,
    "city": "武陟"
  },
  {
    "cityid": 101181104,
    "city": "沁阳"
  },
  {
    "cityid": 101181106,
    "city": "博爱"
  },
  {
    "cityid": 101181107,
    "city": "温县"
  },
  {
    "cityid": 101181108,
    "city": "孟州"
  },
  {
    "cityid": 101181201,
    "city": "鹤壁"
  },
  {
    "cityid": 101181202,
    "city": "浚县"
  },
  {
    "cityid": 101181203,
    "city": "淇县"
  },
  {
    "cityid": 101181301,
    "city": "濮阳"
  },
  {
    "cityid": 101181302,
    "city": "台前"
  },
  {
    "cityid": 101181303,
    "city": "南乐"
  },
  {
    "cityid": 101181304,
    "city": "清丰"
  },
  {
    "cityid": 101181305,
    "city": "范县"
  },
  {
    "cityid": 101181401,
    "city": "周口"
  },
  {
    "cityid": 101181402,
    "city": "扶沟"
  },
  {
    "cityid": 101181403,
    "city": "太康"
  },
  {
    "cityid": 101181404,
    "city": "淮阳"
  },
  {
    "cityid": 101181405,
    "city": "西华"
  },
  {
    "cityid": 101181406,
    "city": "商水"
  },
  {
    "cityid": 101181407,
    "city": "项城"
  },
  {
    "cityid": 101181408,
    "city": "郸城"
  },
  {
    "cityid": 101181409,
    "city": "鹿邑"
  },
  {
    "cityid": 101181410,
    "city": "沈丘"
  },
  {
    "cityid": 101181501,
    "city": "漯河"
  },
  {
    "cityid": 101181502,
    "city": "临颍"
  },
  {
    "cityid": 101181503,
    "city": "舞阳"
  },
  {
    "cityid": 101181601,
    "city": "驻马店"
  },
  {
    "cityid": 101181602,
    "city": "西平"
  },
  {
    "cityid": 101181603,
    "city": "遂平"
  },
  {
    "cityid": 101181604,
    "city": "上蔡"
  },
  {
    "cityid": 101181605,
    "city": "汝南"
  },
  {
    "cityid": 101181606,
    "city": "泌阳"
  },
  {
    "cityid": 101181607,
    "city": "平舆"
  },
  {
    "cityid": 101181608,
    "city": "新蔡"
  },
  {
    "cityid": 101181609,
    "city": "确山"
  },
  {
    "cityid": 101181610,
    "city": "正阳"
  },
  {
    "cityid": 101181701,
    "city": "三门峡"
  },
  {
    "cityid": 101181702,
    "city": "灵宝"
  },
  {
    "cityid": 101181703,
    "city": "渑池"
  },
  {
    "cityid": 101181704,
    "city": "卢氏"
  },
  {
    "cityid": 101181705,
    "city": "义马"
  },
  {
    "cityid": 101181706,
    "city": "陕县"
  },
  {
    "cityid": 101181801,
    "city": "济源"
  },
  {
    "cityid": 101190101,
    "city": "南京"
  },
  {
    "cityid": 101190102,
    "city": "溧水"
  },
  {
    "cityid": 101190103,
    "city": "高淳"
  },
  {
    "cityid": 101190104,
    "city": "江宁"
  },
  {
    "cityid": 101190105,
    "city": "六合"
  },
  {
    "cityid": 101190106,
    "city": "江浦"
  },
  {
    "cityid": 101190107,
    "city": "浦口"
  },
  {
    "cityid": 101190201,
    "city": "无锡"
  },
  {
    "cityid": 101190202,
    "city": "江阴"
  },
  {
    "cityid": 101190203,
    "city": "宜兴"
  },
  {
    "cityid": 101190204,
    "city": "锡山"
  },
  {
    "cityid": 101190301,
    "city": "镇江"
  },
  {
    "cityid": 101190302,
    "city": "丹阳"
  },
  {
    "cityid": 101190303,
    "city": "扬中"
  },
  {
    "cityid": 101190304,
    "city": "句容"
  },
  {
    "cityid": 101190305,
    "city": "丹徒"
  },
  {
    "cityid": 101190401,
    "city": "苏州"
  },
  {
    "cityid": 101190402,
    "city": "常熟"
  },
  {
    "cityid": 101190403,
    "city": "张家港"
  },
  {
    "cityid": 101190404,
    "city": "昆山"
  },
  {
    "cityid": 101190405,
    "city": "吴中"
  },
  {
    "cityid": 101190407,
    "city": "吴江"
  },
  {
    "cityid": 101190408,
    "city": "太仓"
  },
  {
    "cityid": 101190501,
    "city": "南通"
  },
  {
    "cityid": 101190502,
    "city": "海安"
  },
  {
    "cityid": 101190503,
    "city": "如皋"
  },
  {
    "cityid": 101190504,
    "city": "如东"
  },
  {
    "cityid": 101190507,
    "city": "启东"
  },
  {
    "cityid": 101190508,
    "city": "海门"
  },
  {
    "cityid": 101190509,
    "city": "通州"
  },
  {
    "cityid": 101190601,
    "city": "扬州"
  },
  {
    "cityid": 101190602,
    "city": "宝应"
  },
  {
    "cityid": 101190603,
    "city": "仪征"
  },
  {
    "cityid": 101190604,
    "city": "高邮"
  },
  {
    "cityid": 101190605,
    "city": "江都"
  },
  {
    "cityid": 101190606,
    "city": "邗江"
  },
  {
    "cityid": 101190701,
    "city": "盐城"
  },
  {
    "cityid": 101190702,
    "city": "响水"
  },
  {
    "cityid": 101190703,
    "city": "滨海"
  },
  {
    "cityid": 101190704,
    "city": "阜宁"
  },
  {
    "cityid": 101190705,
    "city": "射阳"
  },
  {
    "cityid": 101190706,
    "city": "建湖"
  },
  {
    "cityid": 101190707,
    "city": "东台"
  },
  {
    "cityid": 101190708,
    "city": "大丰"
  },
  {
    "cityid": 101190709,
    "city": "盐都"
  },
  {
    "cityid": 101190801,
    "city": "徐州"
  },
  {
    "cityid": 101190802,
    "city": "铜山"
  },
  {
    "cityid": 101190803,
    "city": "丰县"
  },
  {
    "cityid": 101190804,
    "city": "沛县"
  },
  {
    "cityid": 101190805,
    "city": "邳州"
  },
  {
    "cityid": 101190806,
    "city": "睢宁"
  },
  {
    "cityid": 101190807,
    "city": "新沂"
  },
  {
    "cityid": 101190901,
    "city": "淮安"
  },
  {
    "cityid": 101190902,
    "city": "金湖"
  },
  {
    "cityid": 101190903,
    "city": "盱眙"
  },
  {
    "cityid": 101190904,
    "city": "洪泽"
  },
  {
    "cityid": 101190905,
    "city": "涟水"
  },
  {
    "cityid": 101190906,
    "city": "淮阴区"
  },
  {
    "cityid": 101190908,
    "city": "淮安区"
  },
  {
    "cityid": 101191001,
    "city": "连云港"
  },
  {
    "cityid": 101191002,
    "city": "东海"
  },
  {
    "cityid": 101191003,
    "city": "赣榆"
  },
  {
    "cityid": 101191004,
    "city": "灌云"
  },
  {
    "cityid": 101191005,
    "city": "灌南"
  },
  {
    "cityid": 101191101,
    "city": "常州"
  },
  {
    "cityid": 101191102,
    "city": "溧阳"
  },
  {
    "cityid": 101191103,
    "city": "金坛"
  },
  {
    "cityid": 101191104,
    "city": "武进"
  },
  {
    "cityid": 101191201,
    "city": "泰州"
  },
  {
    "cityid": 101191202,
    "city": "兴化"
  },
  {
    "cityid": 101191203,
    "city": "泰兴"
  },
  {
    "cityid": 101191204,
    "city": "姜堰"
  },
  {
    "cityid": 101191205,
    "city": "靖江"
  },
  {
    "cityid": 101191301,
    "city": "宿迁"
  },
  {
    "cityid": 101191302,
    "city": "沭阳"
  },
  {
    "cityid": 101191303,
    "city": "泗阳"
  },
  {
    "cityid": 101191304,
    "city": "泗洪"
  },
  {
    "cityid": 101191305,
    "city": "宿豫"
  },
  {
    "cityid": 101200101,
    "city": "武汉"
  },
  {
    "cityid": 101200102,
    "city": "蔡甸"
  },
  {
    "cityid": 101200103,
    "city": "黄陂"
  },
  {
    "cityid": 101200104,
    "city": "新洲"
  },
  {
    "cityid": 101200105,
    "city": "江夏"
  },
  {
    "cityid": 101200106,
    "city": "东西湖"
  },
  {
    "cityid": 101200201,
    "city": "襄阳"
  },
  {
    "cityid": 101200202,
    "city": "襄州"
  },
  {
    "cityid": 101200203,
    "city": "保康"
  },
  {
    "cityid": 101200204,
    "city": "南漳"
  },
  {
    "cityid": 101200205,
    "city": "宜城"
  },
  {
    "cityid": 101200206,
    "city": "老河口"
  },
  {
    "cityid": 101200207,
    "city": "谷城"
  },
  {
    "cityid": 101200208,
    "city": "枣阳"
  },
  {
    "cityid": 101200301,
    "city": "鄂州"
  },
  {
    "cityid": 101200302,
    "city": "梁子湖"
  },
  {
    "cityid": 101200401,
    "city": "孝感"
  },
  {
    "cityid": 101200402,
    "city": "安陆"
  },
  {
    "cityid": 101200403,
    "city": "云梦"
  },
  {
    "cityid": 101200404,
    "city": "大悟"
  },
  {
    "cityid": 101200405,
    "city": "应城"
  },
  {
    "cityid": 101200406,
    "city": "汉川"
  },
  {
    "cityid": 101200407,
    "city": "孝昌"
  },
  {
    "cityid": 101200501,
    "city": "黄冈"
  },
  {
    "cityid": 101200502,
    "city": "红安"
  },
  {
    "cityid": 101200503,
    "city": "麻城"
  },
  {
    "cityid": 101200504,
    "city": "罗田"
  },
  {
    "cityid": 101200505,
    "city": "英山"
  },
  {
    "cityid": 101200506,
    "city": "浠水"
  },
  {
    "cityid": 101200507,
    "city": "蕲春"
  },
  {
    "cityid": 101200508,
    "city": "黄梅"
  },
  {
    "cityid": 101200509,
    "city": "武穴"
  },
  {
    "cityid": 101200510,
    "city": "团风"
  },
  {
    "cityid": 101200601,
    "city": "黄石"
  },
  {
    "cityid": 101200602,
    "city": "大冶"
  },
  {
    "cityid": 101200603,
    "city": "阳新"
  },
  {
    "cityid": 101200604,
    "city": "铁山"
  },
  {
    "cityid": 101200605,
    "city": "下陆"
  },
  {
    "cityid": 101200606,
    "city": "西塞山"
  },
  {
    "cityid": 101200701,
    "city": "咸宁"
  },
  {
    "cityid": 101200702,
    "city": "赤壁"
  },
  {
    "cityid": 101200703,
    "city": "嘉鱼"
  },
  {
    "cityid": 101200704,
    "city": "崇阳"
  },
  {
    "cityid": 101200705,
    "city": "通城"
  },
  {
    "cityid": 101200706,
    "city": "通山"
  },
  {
    "cityid": 101200801,
    "city": "荆州"
  },
  {
    "cityid": 101200802,
    "city": "江陵"
  },
  {
    "cityid": 101200803,
    "city": "公安"
  },
  {
    "cityid": 101200804,
    "city": "石首"
  },
  {
    "cityid": 101200805,
    "city": "监利"
  },
  {
    "cityid": 101200806,
    "city": "洪湖"
  },
  {
    "cityid": 101200807,
    "city": "松滋"
  },
  {
    "cityid": 101200901,
    "city": "宜昌"
  },
  {
    "cityid": 101200902,
    "city": "远安"
  },
  {
    "cityid": 101200903,
    "city": "秭归"
  },
  {
    "cityid": 101200904,
    "city": "兴山"
  },
  {
    "cityid": 101200906,
    "city": "五峰"
  },
  {
    "cityid": 101200907,
    "city": "当阳"
  },
  {
    "cityid": 101200908,
    "city": "长阳"
  },
  {
    "cityid": 101200909,
    "city": "宜都"
  },
  {
    "cityid": 101200910,
    "city": "枝江"
  },
  {
    "cityid": 101200911,
    "city": "三峡"
  },
  {
    "cityid": 101200912,
    "city": "夷陵"
  },
  {
    "cityid": 101201001,
    "city": "恩施"
  },
  {
    "cityid": 101201002,
    "city": "利川"
  },
  {
    "cityid": 101201003,
    "city": "建始"
  },
  {
    "cityid": 101201004,
    "city": "咸丰"
  },
  {
    "cityid": 101201005,
    "city": "宣恩"
  },
  {
    "cityid": 101201006,
    "city": "鹤峰"
  },
  {
    "cityid": 101201007,
    "city": "来凤"
  },
  {
    "cityid": 101201008,
    "city": "巴东"
  },
  {
    "cityid": 101201101,
    "city": "十堰"
  },
  {
    "cityid": 101201102,
    "city": "竹溪"
  },
  {
    "cityid": 101201103,
    "city": "郧西"
  },
  {
    "cityid": 101201104,
    "city": "郧县"
  },
  {
    "cityid": 101201105,
    "city": "竹山"
  },
  {
    "cityid": 101201106,
    "city": "房县"
  },
  {
    "cityid": 101201107,
    "city": "丹江口"
  },
  {
    "cityid": 101201108,
    "city": "茅箭"
  },
  {
    "cityid": 101201109,
    "city": "张湾"
  },
  {
    "cityid": 101201201,
    "city": "神农架"
  },
  {
    "cityid": 101201301,
    "city": "随州"
  },
  {
    "cityid": 101201302,
    "city": "广水"
  },
  {
    "cityid": 101201401,
    "city": "荆门"
  },
  {
    "cityid": 101201402,
    "city": "钟祥"
  },
  {
    "cityid": 101201403,
    "city": "京山"
  },
  {
    "cityid": 101201404,
    "city": "掇刀"
  },
  {
    "cityid": 101201405,
    "city": "沙洋"
  },
  {
    "cityid": 101201406,
    "city": "沙市"
  },
  {
    "cityid": 101201501,
    "city": "天门"
  },
  {
    "cityid": 101201601,
    "city": "仙桃"
  },
  {
    "cityid": 101201701,
    "city": "潜江"
  },
  {
    "cityid": 101210101,
    "city": "杭州"
  },
  {
    "cityid": 101210102,
    "city": "萧山"
  },
  {
    "cityid": 101210103,
    "city": "桐庐"
  },
  {
    "cityid": 101210104,
    "city": "淳安"
  },
  {
    "cityid": 101210105,
    "city": "建德"
  },
  {
    "cityid": 101210106,
    "city": "余杭"
  },
  {
    "cityid": 101210107,
    "city": "临安"
  },
  {
    "cityid": 101210108,
    "city": "富阳"
  },
  {
    "cityid": 101210201,
    "city": "湖州"
  },
  {
    "cityid": 101210202,
    "city": "长兴"
  },
  {
    "cityid": 101210203,
    "city": "安吉"
  },
  {
    "cityid": 101210204,
    "city": "德清"
  },
  {
    "cityid": 101210301,
    "city": "嘉兴"
  },
  {
    "cityid": 101210302,
    "city": "嘉善"
  },
  {
    "cityid": 101210303,
    "city": "海宁"
  },
  {
    "cityid": 101210304,
    "city": "桐乡"
  },
  {
    "cityid": 101210305,
    "city": "平湖"
  },
  {
    "cityid": 101210306,
    "city": "海盐"
  },
  {
    "cityid": 101210401,
    "city": "宁波"
  },
  {
    "cityid": 101210403,
    "city": "慈溪"
  },
  {
    "cityid": 101210404,
    "city": "余姚"
  },
  {
    "cityid": 101210405,
    "city": "奉化"
  },
  {
    "cityid": 101210406,
    "city": "象山"
  },
  {
    "cityid": 101210408,
    "city": "宁海"
  },
  {
    "cityid": 101210410,
    "city": "北仑"
  },
  {
    "cityid": 101210411,
    "city": "鄞州"
  },
  {
    "cityid": 101210412,
    "city": "镇海"
  },
  {
    "cityid": 101210501,
    "city": "绍兴"
  },
  {
    "cityid": 101210502,
    "city": "诸暨"
  },
  {
    "cityid": 101210503,
    "city": "上虞"
  },
  {
    "cityid": 101210504,
    "city": "新昌"
  },
  {
    "cityid": 101210505,
    "city": "嵊州"
  },
  {
    "cityid": 101210601,
    "city": "台州"
  },
  {
    "cityid": 101210603,
    "city": "玉环"
  },
  {
    "cityid": 101210604,
    "city": "三门"
  },
  {
    "cityid": 101210605,
    "city": "天台"
  },
  {
    "cityid": 101210606,
    "city": "仙居"
  },
  {
    "cityid": 101210607,
    "city": "温岭"
  },
  {
    "cityid": 101210609,
    "city": "洪家"
  },
  {
    "cityid": 101210610,
    "city": "临海"
  },
  {
    "cityid": 101210611,
    "city": "椒江"
  },
  {
    "cityid": 101210612,
    "city": "黄岩"
  },
  {
    "cityid": 101210613,
    "city": "路桥"
  },
  {
    "cityid": 101210701,
    "city": "温州"
  },
  {
    "cityid": 101210702,
    "city": "泰顺"
  },
  {
    "cityid": 101210703,
    "city": "文成"
  },
  {
    "cityid": 101210704,
    "city": "平阳"
  },
  {
    "cityid": 101210705,
    "city": "瑞安"
  },
  {
    "cityid": 101210706,
    "city": "洞头"
  },
  {
    "cityid": 101210707,
    "city": "乐清"
  },
  {
    "cityid": 101210708,
    "city": "永嘉"
  },
  {
    "cityid": 101210709,
    "city": "苍南"
  },
  {
    "cityid": 101210801,
    "city": "丽水"
  },
  {
    "cityid": 101210802,
    "city": "遂昌"
  },
  {
    "cityid": 101210803,
    "city": "龙泉"
  },
  {
    "cityid": 101210804,
    "city": "缙云"
  },
  {
    "cityid": 101210805,
    "city": "青田"
  },
  {
    "cityid": 101210806,
    "city": "云和"
  },
  {
    "cityid": 101210807,
    "city": "庆元"
  },
  {
    "cityid": 101210808,
    "city": "松阳"
  },
  {
    "cityid": 101210809,
    "city": "景宁"
  },
  {
    "cityid": 101210901,
    "city": "金华"
  },
  {
    "cityid": 101210902,
    "city": "浦江"
  },
  {
    "cityid": 101210903,
    "city": "兰溪"
  },
  {
    "cityid": 101210904,
    "city": "义乌"
  },
  {
    "cityid": 101210905,
    "city": "东阳"
  },
  {
    "cityid": 101210906,
    "city": "武义"
  },
  {
    "cityid": 101210907,
    "city": "永康"
  },
  {
    "cityid": 101210908,
    "city": "磐安"
  },
  {
    "cityid": 101211001,
    "city": "衢州"
  },
  {
    "cityid": 101211002,
    "city": "常山"
  },
  {
    "cityid": 101211003,
    "city": "开化"
  },
  {
    "cityid": 101211004,
    "city": "龙游"
  },
  {
    "cityid": 101211005,
    "city": "江山"
  },
  {
    "cityid": 101211006,
    "city": "衢江"
  },
  {
    "cityid": 101211101,
    "city": "舟山"
  },
  {
    "cityid": 101211102,
    "city": "嵊泗"
  },
  {
    "cityid": 101211104,
    "city": "岱山"
  },
  {
    "cityid": 101211105,
    "city": "普陀"
  },
  {
    "cityid": 101211106,
    "city": "定海"
  },
  {
    "cityid": 101220101,
    "city": "合肥"
  },
  {
    "cityid": 101220102,
    "city": "长丰"
  },
  {
    "cityid": 101220103,
    "city": "肥东"
  },
  {
    "cityid": 101220104,
    "city": "肥西"
  },
  {
    "cityid": 101220105,
    "city": "巢湖"
  },
  {
    "cityid": 101220106,
    "city": "庐江"
  },
  {
    "cityid": 101220201,
    "city": "蚌埠"
  },
  {
    "cityid": 101220202,
    "city": "怀远"
  },
  {
    "cityid": 101220203,
    "city": "固镇"
  },
  {
    "cityid": 101220204,
    "city": "五河"
  },
  {
    "cityid": 101220301,
    "city": "芜湖"
  },
  {
    "cityid": 101220302,
    "city": "繁昌"
  },
  {
    "cityid": 101220303,
    "city": "芜湖县"
  },
  {
    "cityid": 101220304,
    "city": "南陵"
  },
  {
    "cityid": 101220305,
    "city": "无为"
  },
  {
    "cityid": 101220401,
    "city": "淮南"
  },
  {
    "cityid": 101220402,
    "city": "凤台"
  },
  {
    "cityid": 101220403,
    "city": "潘集"
  },
  {
    "cityid": 101220501,
    "city": "马鞍山"
  },
  {
    "cityid": 101220502,
    "city": "当涂"
  },
  {
    "cityid": 101220503,
    "city": "含山"
  },
  {
    "cityid": 101220504,
    "city": "和县"
  },
  {
    "cityid": 101220601,
    "city": "安庆"
  },
  {
    "cityid": 101220602,
    "city": "枞阳"
  },
  {
    "cityid": 101220603,
    "city": "太湖"
  },
  {
    "cityid": 101220604,
    "city": "潜山"
  },
  {
    "cityid": 101220605,
    "city": "怀宁"
  },
  {
    "cityid": 101220606,
    "city": "宿松"
  },
  {
    "cityid": 101220607,
    "city": "望江"
  },
  {
    "cityid": 101220608,
    "city": "岳西"
  },
  {
    "cityid": 101220609,
    "city": "桐城"
  },
  {
    "cityid": 101220701,
    "city": "宿州"
  },
  {
    "cityid": 101220702,
    "city": "砀山"
  },
  {
    "cityid": 101220703,
    "city": "灵璧"
  },
  {
    "cityid": 101220704,
    "city": "泗县"
  },
  {
    "cityid": 101220705,
    "city": "萧县"
  },
  {
    "cityid": 101220801,
    "city": "阜阳"
  },
  {
    "cityid": 101220802,
    "city": "阜南"
  },
  {
    "cityid": 101220803,
    "city": "颍上"
  },
  {
    "cityid": 101220804,
    "city": "临泉"
  },
  {
    "cityid": 101220805,
    "city": "界首"
  },
  {
    "cityid": 101220806,
    "city": "太和"
  },
  {
    "cityid": 101220901,
    "city": "亳州"
  },
  {
    "cityid": 101220902,
    "city": "涡阳"
  },
  {
    "cityid": 101220903,
    "city": "利辛"
  },
  {
    "cityid": 101220904,
    "city": "蒙城"
  },
  {
    "cityid": 101221001,
    "city": "黄山"
  },
  {
    "cityid": 101221002,
    "city": "黄山区"
  },
  {
    "cityid": 101221003,
    "city": "屯溪"
  },
  {
    "cityid": 101221004,
    "city": "祁门"
  },
  {
    "cityid": 101221005,
    "city": "黟县"
  },
  {
    "cityid": 101221006,
    "city": "歙县"
  },
  {
    "cityid": 101221007,
    "city": "休宁"
  },
  {
    "cityid": 101221008,
    "city": "黄山风景区"
  },
  {
    "cityid": 101221101,
    "city": "滁州"
  },
  {
    "cityid": 101221102,
    "city": "凤阳"
  },
  {
    "cityid": 101221103,
    "city": "明光"
  },
  {
    "cityid": 101221104,
    "city": "定远"
  },
  {
    "cityid": 101221105,
    "city": "全椒"
  },
  {
    "cityid": 101221106,
    "city": "来安"
  },
  {
    "cityid": 101221107,
    "city": "天长"
  },
  {
    "cityid": 101221201,
    "city": "淮北"
  },
  {
    "cityid": 101221202,
    "city": "濉溪"
  },
  {
    "cityid": 101221301,
    "city": "铜陵"
  },
  {
    "cityid": 101221401,
    "city": "宣城"
  },
  {
    "cityid": 101221402,
    "city": "泾县"
  },
  {
    "cityid": 101221403,
    "city": "旌德"
  },
  {
    "cityid": 101221404,
    "city": "宁国"
  },
  {
    "cityid": 101221405,
    "city": "绩溪"
  },
  {
    "cityid": 101221406,
    "city": "广德"
  },
  {
    "cityid": 101221407,
    "city": "郎溪"
  },
  {
    "cityid": 101221501,
    "city": "六安"
  },
  {
    "cityid": 101221502,
    "city": "霍邱"
  },
  {
    "cityid": 101221503,
    "city": "寿县"
  },
  {
    "cityid": 101221505,
    "city": "金寨"
  },
  {
    "cityid": 101221506,
    "city": "霍山"
  },
  {
    "cityid": 101221507,
    "city": "舒城"
  },
  {
    "cityid": 101221701,
    "city": "池州"
  },
  {
    "cityid": 101221702,
    "city": "东至"
  },
  {
    "cityid": 101221703,
    "city": "青阳"
  },
  {
    "cityid": 101221704,
    "city": "九华山"
  },
  {
    "cityid": 101221705,
    "city": "石台"
  },
  {
    "cityid": 101230101,
    "city": "福州"
  },
  {
    "cityid": 101230102,
    "city": "闽清"
  },
  {
    "cityid": 101230103,
    "city": "闽侯"
  },
  {
    "cityid": 101230104,
    "city": "罗源"
  },
  {
    "cityid": 101230105,
    "city": "连江"
  },
  {
    "cityid": 101230107,
    "city": "永泰"
  },
  {
    "cityid": 101230108,
    "city": "平潭"
  },
  {
    "cityid": 101230110,
    "city": "长乐"
  },
  {
    "cityid": 101230111,
    "city": "福清"
  },
  {
    "cityid": 101230201,
    "city": "厦门"
  },
  {
    "cityid": 101230202,
    "city": "同安"
  },
  {
    "cityid": 101230301,
    "city": "宁德"
  },
  {
    "cityid": 101230302,
    "city": "古田"
  },
  {
    "cityid": 101230303,
    "city": "霞浦"
  },
  {
    "cityid": 101230304,
    "city": "寿宁"
  },
  {
    "cityid": 101230305,
    "city": "周宁"
  },
  {
    "cityid": 101230306,
    "city": "福安"
  },
  {
    "cityid": 101230307,
    "city": "柘荣"
  },
  {
    "cityid": 101230308,
    "city": "福鼎"
  },
  {
    "cityid": 101230309,
    "city": "屏南"
  },
  {
    "cityid": 101230401,
    "city": "莆田"
  },
  {
    "cityid": 101230402,
    "city": "仙游"
  },
  {
    "cityid": 101230403,
    "city": "秀屿港"
  },
  {
    "cityid": 101230404,
    "city": "涵江"
  },
  {
    "cityid": 101230405,
    "city": "秀屿"
  },
  {
    "cityid": 101230406,
    "city": "荔城"
  },
  {
    "cityid": 101230407,
    "city": "城厢"
  },
  {
    "cityid": 101230501,
    "city": "泉州"
  },
  {
    "cityid": 101230502,
    "city": "安溪"
  },
  {
    "cityid": 101230504,
    "city": "永春"
  },
  {
    "cityid": 101230505,
    "city": "德化"
  },
  {
    "cityid": 101230506,
    "city": "南安"
  },
  {
    "cityid": 101230507,
    "city": "崇武"
  },
  {
    "cityid": 101230508,
    "city": "惠安"
  },
  {
    "cityid": 101230509,
    "city": "晋江"
  },
  {
    "cityid": 101230510,
    "city": "石狮"
  },
  {
    "cityid": 101230601,
    "city": "漳州"
  },
  {
    "cityid": 101230602,
    "city": "长泰"
  },
  {
    "cityid": 101230603,
    "city": "南靖"
  },
  {
    "cityid": 101230604,
    "city": "平和"
  },
  {
    "cityid": 101230605,
    "city": "龙海"
  },
  {
    "cityid": 101230606,
    "city": "漳浦"
  },
  {
    "cityid": 101230607,
    "city": "诏安"
  },
  {
    "cityid": 101230608,
    "city": "东山"
  },
  {
    "cityid": 101230609,
    "city": "云霄"
  },
  {
    "cityid": 101230610,
    "city": "华安"
  },
  {
    "cityid": 101230701,
    "city": "龙岩"
  },
  {
    "cityid": 101230702,
    "city": "长汀"
  },
  {
    "cityid": 101230703,
    "city": "连城"
  },
  {
    "cityid": 101230704,
    "city": "武平"
  },
  {
    "cityid": 101230705,
    "city": "上杭"
  },
  {
    "cityid": 101230706,
    "city": "永定"
  },
  {
    "cityid": 101230707,
    "city": "漳平"
  },
  {
    "cityid": 101230801,
    "city": "三明"
  },
  {
    "cityid": 101230802,
    "city": "宁化"
  },
  {
    "cityid": 101230803,
    "city": "清流"
  },
  {
    "cityid": 101230804,
    "city": "泰宁"
  },
  {
    "cityid": 101230805,
    "city": "将乐"
  },
  {
    "cityid": 101230806,
    "city": "建宁"
  },
  {
    "cityid": 101230807,
    "city": "明溪"
  },
  {
    "cityid": 101230808,
    "city": "沙县"
  },
  {
    "cityid": 101230809,
    "city": "尤溪"
  },
  {
    "cityid": 101230810,
    "city": "永安"
  },
  {
    "cityid": 101230811,
    "city": "大田"
  },
  {
    "cityid": 101230901,
    "city": "南平"
  },
  {
    "cityid": 101230902,
    "city": "顺昌"
  },
  {
    "cityid": 101230903,
    "city": "光泽"
  },
  {
    "cityid": 101230904,
    "city": "邵武"
  },
  {
    "cityid": 101230905,
    "city": "武夷山"
  },
  {
    "cityid": 101230906,
    "city": "浦城"
  },
  {
    "cityid": 101230907,
    "city": "建阳"
  },
  {
    "cityid": 101230908,
    "city": "松溪"
  },
  {
    "cityid": 101230909,
    "city": "政和"
  },
  {
    "cityid": 101230910,
    "city": "建瓯"
  },
  {
    "cityid": 101231001,
    "city": "钓鱼岛"
  },
  {
    "cityid": 101240101,
    "city": "南昌"
  },
  {
    "cityid": 101240102,
    "city": "新建"
  },
  {
    "cityid": 101240103,
    "city": "南昌县"
  },
  {
    "cityid": 101240104,
    "city": "安义"
  },
  {
    "cityid": 101240105,
    "city": "进贤"
  },
  {
    "cityid": 101240201,
    "city": "九江"
  },
  {
    "cityid": 101240202,
    "city": "瑞昌"
  },
  {
    "cityid": 101240203,
    "city": "庐山"
  },
  {
    "cityid": 101240204,
    "city": "武宁"
  },
  {
    "cityid": 101240205,
    "city": "德安"
  },
  {
    "cityid": 101240206,
    "city": "永修"
  },
  {
    "cityid": 101240207,
    "city": "湖口"
  },
  {
    "cityid": 101240208,
    "city": "彭泽"
  },
  {
    "cityid": 101240209,
    "city": "星子"
  },
  {
    "cityid": 101240210,
    "city": "都昌"
  },
  {
    "cityid": 101240212,
    "city": "修水"
  },
  {
    "cityid": 101240301,
    "city": "上饶"
  },
  {
    "cityid": 101240302,
    "city": "鄱阳"
  },
  {
    "cityid": 101240303,
    "city": "婺源"
  },
  {
    "cityid": 101240305,
    "city": "余干"
  },
  {
    "cityid": 101240306,
    "city": "万年"
  },
  {
    "cityid": 101240307,
    "city": "德兴"
  },
  {
    "cityid": 101240308,
    "city": "上饶县"
  },
  {
    "cityid": 101240309,
    "city": "弋阳"
  },
  {
    "cityid": 101240310,
    "city": "横峰"
  },
  {
    "cityid": 101240311,
    "city": "铅山"
  },
  {
    "cityid": 101240312,
    "city": "玉山"
  },
  {
    "cityid": 101240313,
    "city": "广丰"
  },
  {
    "cityid": 101240401,
    "city": "抚州"
  },
  {
    "cityid": 101240402,
    "city": "广昌"
  },
  {
    "cityid": 101240403,
    "city": "乐安"
  },
  {
    "cityid": 101240404,
    "city": "崇仁"
  },
  {
    "cityid": 101240405,
    "city": "金溪"
  },
  {
    "cityid": 101240406,
    "city": "资溪"
  },
  {
    "cityid": 101240407,
    "city": "宜黄"
  },
  {
    "cityid": 101240408,
    "city": "南城"
  },
  {
    "cityid": 101240409,
    "city": "南丰"
  },
  {
    "cityid": 101240410,
    "city": "黎川"
  },
  {
    "cityid": 101240411,
    "city": "东乡"
  },
  {
    "cityid": 101240501,
    "city": "宜春"
  },
  {
    "cityid": 101240502,
    "city": "铜鼓"
  },
  {
    "cityid": 101240503,
    "city": "宜丰"
  },
  {
    "cityid": 101240504,
    "city": "万载"
  },
  {
    "cityid": 101240505,
    "city": "上高"
  },
  {
    "cityid": 101240506,
    "city": "靖安"
  },
  {
    "cityid": 101240507,
    "city": "奉新"
  },
  {
    "cityid": 101240508,
    "city": "高安"
  },
  {
    "cityid": 101240509,
    "city": "樟树"
  },
  {
    "cityid": 101240510,
    "city": "丰城"
  },
  {
    "cityid": 101240601,
    "city": "吉安"
  },
  {
    "cityid": 101240602,
    "city": "吉安县"
  },
  {
    "cityid": 101240603,
    "city": "吉水"
  },
  {
    "cityid": 101240604,
    "city": "新干"
  },
  {
    "cityid": 101240605,
    "city": "峡江"
  },
  {
    "cityid": 101240606,
    "city": "永丰"
  },
  {
    "cityid": 101240607,
    "city": "永新"
  },
  {
    "cityid": 101240608,
    "city": "井冈山"
  },
  {
    "cityid": 101240609,
    "city": "万安"
  },
  {
    "cityid": 101240610,
    "city": "遂川"
  },
  {
    "cityid": 101240611,
    "city": "泰和"
  },
  {
    "cityid": 101240612,
    "city": "安福"
  },
  {
    "cityid": 101240613,
    "city": "宁冈"
  },
  {
    "cityid": 101240701,
    "city": "赣州"
  },
  {
    "cityid": 101240702,
    "city": "崇义"
  },
  {
    "cityid": 101240703,
    "city": "上犹"
  },
  {
    "cityid": 101240704,
    "city": "南康"
  },
  {
    "cityid": 101240705,
    "city": "大余"
  },
  {
    "cityid": 101240706,
    "city": "信丰"
  },
  {
    "cityid": 101240707,
    "city": "宁都"
  },
  {
    "cityid": 101240708,
    "city": "石城"
  },
  {
    "cityid": 101240709,
    "city": "瑞金"
  },
  {
    "cityid": 101240710,
    "city": "于都"
  },
  {
    "cityid": 101240711,
    "city": "会昌"
  },
  {
    "cityid": 101240712,
    "city": "安远"
  },
  {
    "cityid": 101240713,
    "city": "全南"
  },
  {
    "cityid": 101240714,
    "city": "龙南"
  },
  {
    "cityid": 101240715,
    "city": "定南"
  },
  {
    "cityid": 101240716,
    "city": "寻乌"
  },
  {
    "cityid": 101240717,
    "city": "兴国"
  },
  {
    "cityid": 101240718,
    "city": "赣县"
  },
  {
    "cityid": 101240801,
    "city": "景德镇"
  },
  {
    "cityid": 101240802,
    "city": "乐平"
  },
  {
    "cityid": 101240803,
    "city": "浮梁"
  },
  {
    "cityid": 101240901,
    "city": "萍乡"
  },
  {
    "cityid": 101240902,
    "city": "莲花"
  },
  {
    "cityid": 101240903,
    "city": "上栗"
  },
  {
    "cityid": 101240904,
    "city": "安源"
  },
  {
    "cityid": 101240905,
    "city": "芦溪"
  },
  {
    "cityid": 101240906,
    "city": "湘东"
  },
  {
    "cityid": 101241001,
    "city": "新余"
  },
  {
    "cityid": 101241002,
    "city": "分宜"
  },
  {
    "cityid": 101241101,
    "city": "鹰潭"
  },
  {
    "cityid": 101241102,
    "city": "余江"
  },
  {
    "cityid": 101241103,
    "city": "贵溪"
  },
  {
    "cityid": 101250101,
    "city": "长沙"
  },
  {
    "cityid": 101250102,
    "city": "宁乡"
  },
  {
    "cityid": 101250103,
    "city": "浏阳"
  },
  {
    "cityid": 101250104,
    "city": "马坡岭"
  },
  {
    "cityid": 101250105,
    "city": "望城"
  },
  {
    "cityid": 101250201,
    "city": "湘潭"
  },
  {
    "cityid": 101250202,
    "city": "韶山"
  },
  {
    "cityid": 101250203,
    "city": "湘乡"
  },
  {
    "cityid": 101250301,
    "city": "株洲"
  },
  {
    "cityid": 101250302,
    "city": "攸县"
  },
  {
    "cityid": 101250303,
    "city": "醴陵"
  },
  {
    "cityid": 101250305,
    "city": "茶陵"
  },
  {
    "cityid": 101250306,
    "city": "炎陵"
  },
  {
    "cityid": 101250401,
    "city": "衡阳"
  },
  {
    "cityid": 101250402,
    "city": "衡山"
  },
  {
    "cityid": 101250403,
    "city": "衡东"
  },
  {
    "cityid": 101250404,
    "city": "祁东"
  },
  {
    "cityid": 101250405,
    "city": "衡阳县"
  },
  {
    "cityid": 101250406,
    "city": "常宁"
  },
  {
    "cityid": 101250407,
    "city": "衡南"
  },
  {
    "cityid": 101250408,
    "city": "耒阳"
  },
  {
    "cityid": 101250409,
    "city": "南岳"
  },
  {
    "cityid": 101250501,
    "city": "郴州"
  },
  {
    "cityid": 101250502,
    "city": "桂阳"
  },
  {
    "cityid": 101250503,
    "city": "嘉禾"
  },
  {
    "cityid": 101250504,
    "city": "宜章"
  },
  {
    "cityid": 101250505,
    "city": "临武"
  },
  {
    "cityid": 101250507,
    "city": "资兴"
  },
  {
    "cityid": 101250508,
    "city": "汝城"
  },
  {
    "cityid": 101250509,
    "city": "安仁"
  },
  {
    "cityid": 101250510,
    "city": "永兴"
  },
  {
    "cityid": 101250511,
    "city": "桂东"
  },
  {
    "cityid": 101250512,
    "city": "苏仙"
  },
  {
    "cityid": 101250601,
    "city": "常德"
  },
  {
    "cityid": 101250602,
    "city": "安乡"
  },
  {
    "cityid": 101250603,
    "city": "桃源"
  },
  {
    "cityid": 101250604,
    "city": "汉寿"
  },
  {
    "cityid": 101250605,
    "city": "澧县"
  },
  {
    "cityid": 101250606,
    "city": "临澧"
  },
  {
    "cityid": 101250607,
    "city": "石门"
  },
  {
    "cityid": 101250608,
    "city": "津市"
  },
  {
    "cityid": 101250700,
    "city": "益阳"
  },
  {
    "cityid": 101250701,
    "city": "赫山区"
  },
  {
    "cityid": 101250702,
    "city": "南县"
  },
  {
    "cityid": 101250703,
    "city": "桃江"
  },
  {
    "cityid": 101250704,
    "city": "安化"
  },
  {
    "cityid": 101250705,
    "city": "沅江"
  },
  {
    "cityid": 101250801,
    "city": "娄底"
  },
  {
    "cityid": 101250802,
    "city": "双峰"
  },
  {
    "cityid": 101250803,
    "city": "冷水江"
  },
  {
    "cityid": 101250805,
    "city": "新化"
  },
  {
    "cityid": 101250806,
    "city": "涟源"
  },
  {
    "cityid": 101250901,
    "city": "邵阳"
  },
  {
    "cityid": 101250902,
    "city": "隆回"
  },
  {
    "cityid": 101250903,
    "city": "洞口"
  },
  {
    "cityid": 101250904,
    "city": "新邵"
  },
  {
    "cityid": 101250905,
    "city": "邵东"
  },
  {
    "cityid": 101250906,
    "city": "绥宁"
  },
  {
    "cityid": 101250907,
    "city": "新宁"
  },
  {
    "cityid": 101250908,
    "city": "武冈"
  },
  {
    "cityid": 101250909,
    "city": "城步"
  },
  {
    "cityid": 101250910,
    "city": "邵阳县"
  },
  {
    "cityid": 101251001,
    "city": "岳阳"
  },
  {
    "cityid": 101251002,
    "city": "华容"
  },
  {
    "cityid": 101251003,
    "city": "湘阴"
  },
  {
    "cityid": 101251004,
    "city": "汨罗"
  },
  {
    "cityid": 101251005,
    "city": "平江"
  },
  {
    "cityid": 101251006,
    "city": "临湘"
  },
  {
    "cityid": 101251101,
    "city": "张家界"
  },
  {
    "cityid": 101251102,
    "city": "桑植"
  },
  {
    "cityid": 101251103,
    "city": "慈利"
  },
  {
    "cityid": 101251104,
    "city": "武陵源"
  },
  {
    "cityid": 101251201,
    "city": "怀化"
  },
  {
    "cityid": 101251203,
    "city": "沅陵"
  },
  {
    "cityid": 101251204,
    "city": "辰溪"
  },
  {
    "cityid": 101251205,
    "city": "靖州"
  },
  {
    "cityid": 101251206,
    "city": "会同"
  },
  {
    "cityid": 101251207,
    "city": "通道"
  },
  {
    "cityid": 101251208,
    "city": "麻阳"
  },
  {
    "cityid": 101251209,
    "city": "新晃"
  },
  {
    "cityid": 101251210,
    "city": "芷江"
  },
  {
    "cityid": 101251211,
    "city": "溆浦"
  },
  {
    "cityid": 101251212,
    "city": "中方"
  },
  {
    "cityid": 101251213,
    "city": "洪江"
  },
  {
    "cityid": 101251401,
    "city": "永州"
  },
  {
    "cityid": 101251402,
    "city": "祁阳"
  },
  {
    "cityid": 101251403,
    "city": "东安"
  },
  {
    "cityid": 101251404,
    "city": "双牌"
  },
  {
    "cityid": 101251405,
    "city": "道县"
  },
  {
    "cityid": 101251406,
    "city": "宁远"
  },
  {
    "cityid": 101251407,
    "city": "江永"
  },
  {
    "cityid": 101251408,
    "city": "蓝山"
  },
  {
    "cityid": 101251409,
    "city": "新田"
  },
  {
    "cityid": 101251410,
    "city": "江华"
  },
  {
    "cityid": 101251411,
    "city": "冷水滩"
  },
  {
    "cityid": 101251501,
    "city": "吉首"
  },
  {
    "cityid": 101251502,
    "city": "保靖"
  },
  {
    "cityid": 101251503,
    "city": "永顺"
  },
  {
    "cityid": 101251504,
    "city": "古丈"
  },
  {
    "cityid": 101251505,
    "city": "凤凰"
  },
  {
    "cityid": 101251506,
    "city": "泸溪"
  },
  {
    "cityid": 101251507,
    "city": "龙山"
  },
  {
    "cityid": 101251508,
    "city": "花垣"
  },
  {
    "cityid": 101260101,
    "city": "贵阳"
  },
  {
    "cityid": 101260102,
    "city": "白云"
  },
  {
    "cityid": 101260103,
    "city": "花溪"
  },
  {
    "cityid": 101260104,
    "city": "乌当"
  },
  {
    "cityid": 101260105,
    "city": "息烽"
  },
  {
    "cityid": 101260106,
    "city": "开阳"
  },
  {
    "cityid": 101260107,
    "city": "修文"
  },
  {
    "cityid": 101260108,
    "city": "清镇"
  },
  {
    "cityid": 101260109,
    "city": "小河"
  },
  {
    "cityid": 101260110,
    "city": "云岩"
  },
  {
    "cityid": 101260111,
    "city": "南明"
  },
  {
    "cityid": 101260201,
    "city": "遵义"
  },
  {
    "cityid": 101260202,
    "city": "遵义县"
  },
  {
    "cityid": 101260203,
    "city": "仁怀"
  },
  {
    "cityid": 101260204,
    "city": "绥阳"
  },
  {
    "cityid": 101260205,
    "city": "湄潭"
  },
  {
    "cityid": 101260206,
    "city": "凤冈"
  },
  {
    "cityid": 101260207,
    "city": "桐梓"
  },
  {
    "cityid": 101260208,
    "city": "赤水"
  },
  {
    "cityid": 101260209,
    "city": "习水"
  },
  {
    "cityid": 101260210,
    "city": "道真"
  },
  {
    "cityid": 101260211,
    "city": "正安"
  },
  {
    "cityid": 101260212,
    "city": "务川"
  },
  {
    "cityid": 101260213,
    "city": "余庆"
  },
  {
    "cityid": 101260214,
    "city": "汇川"
  },
  {
    "cityid": 101260215,
    "city": "红花岗"
  },
  {
    "cityid": 101260301,
    "city": "安顺"
  },
  {
    "cityid": 101260302,
    "city": "普定"
  },
  {
    "cityid": 101260303,
    "city": "镇宁"
  },
  {
    "cityid": 101260304,
    "city": "平坝"
  },
  {
    "cityid": 101260305,
    "city": "紫云"
  },
  {
    "cityid": 101260306,
    "city": "关岭"
  },
  {
    "cityid": 101260401,
    "city": "都匀"
  },
  {
    "cityid": 101260402,
    "city": "贵定"
  },
  {
    "cityid": 101260403,
    "city": "瓮安"
  },
  {
    "cityid": 101260404,
    "city": "长顺"
  },
  {
    "cityid": 101260405,
    "city": "福泉"
  },
  {
    "cityid": 101260406,
    "city": "惠水"
  },
  {
    "cityid": 101260407,
    "city": "龙里"
  },
  {
    "cityid": 101260408,
    "city": "罗甸"
  },
  {
    "cityid": 101260409,
    "city": "平塘"
  },
  {
    "cityid": 101260410,
    "city": "独山"
  },
  {
    "cityid": 101260411,
    "city": "三都"
  },
  {
    "cityid": 101260412,
    "city": "荔波"
  },
  {
    "cityid": 101260501,
    "city": "凯里"
  },
  {
    "cityid": 101260502,
    "city": "岑巩"
  },
  {
    "cityid": 101260503,
    "city": "施秉"
  },
  {
    "cityid": 101260504,
    "city": "镇远"
  },
  {
    "cityid": 101260505,
    "city": "黄平"
  },
  {
    "cityid": 101260507,
    "city": "麻江"
  },
  {
    "cityid": 101260508,
    "city": "丹寨"
  },
  {
    "cityid": 101260509,
    "city": "三穗"
  },
  {
    "cityid": 101260510,
    "city": "台江"
  },
  {
    "cityid": 101260511,
    "city": "剑河"
  },
  {
    "cityid": 101260512,
    "city": "雷山"
  },
  {
    "cityid": 101260513,
    "city": "黎平"
  },
  {
    "cityid": 101260514,
    "city": "天柱"
  },
  {
    "cityid": 101260515,
    "city": "锦屏"
  },
  {
    "cityid": 101260516,
    "city": "榕江"
  },
  {
    "cityid": 101260517,
    "city": "从江"
  },
  {
    "cityid": 101260601,
    "city": "铜仁"
  },
  {
    "cityid": 101260602,
    "city": "江口"
  },
  {
    "cityid": 101260603,
    "city": "玉屏"
  },
  {
    "cityid": 101260604,
    "city": "万山"
  },
  {
    "cityid": 101260605,
    "city": "思南"
  },
  {
    "cityid": 101260607,
    "city": "印江"
  },
  {
    "cityid": 101260608,
    "city": "石阡"
  },
  {
    "cityid": 101260609,
    "city": "沿河"
  },
  {
    "cityid": 101260610,
    "city": "德江"
  },
  {
    "cityid": 101260611,
    "city": "松桃"
  },
  {
    "cityid": 101260701,
    "city": "毕节"
  },
  {
    "cityid": 101260702,
    "city": "赫章"
  },
  {
    "cityid": 101260703,
    "city": "金沙"
  },
  {
    "cityid": 101260704,
    "city": "威宁"
  },
  {
    "cityid": 101260705,
    "city": "大方"
  },
  {
    "cityid": 101260706,
    "city": "纳雍"
  },
  {
    "cityid": 101260707,
    "city": "织金"
  },
  {
    "cityid": 101260708,
    "city": "黔西"
  },
  {
    "cityid": 101260801,
    "city": "水城"
  },
  {
    "cityid": 101260802,
    "city": "六枝"
  },
  {
    "cityid": 101260804,
    "city": "盘县"
  },
  {
    "cityid": 101260901,
    "city": "兴义"
  },
  {
    "cityid": 101260902,
    "city": "晴隆"
  },
  {
    "cityid": 101260903,
    "city": "兴仁"
  },
  {
    "cityid": 101260904,
    "city": "贞丰"
  },
  {
    "cityid": 101260905,
    "city": "望谟"
  },
  {
    "cityid": 101260907,
    "city": "安龙"
  },
  {
    "cityid": 101260908,
    "city": "册亨"
  },
  {
    "cityid": 101260909,
    "city": "普安"
  },
  {
    "cityid": 101270101,
    "city": "成都"
  },
  {
    "cityid": 101270102,
    "city": "龙泉驿"
  },
  {
    "cityid": 101270103,
    "city": "新都"
  },
  {
    "cityid": 101270104,
    "city": "温江"
  },
  {
    "cityid": 101270105,
    "city": "金堂"
  },
  {
    "cityid": 101270106,
    "city": "双流"
  },
  {
    "cityid": 101270107,
    "city": "郫县"
  },
  {
    "cityid": 101270108,
    "city": "大邑"
  },
  {
    "cityid": 101270109,
    "city": "蒲江"
  },
  {
    "cityid": 101270110,
    "city": "新津"
  },
  {
    "cityid": 101270111,
    "city": "都江堰"
  },
  {
    "cityid": 101270112,
    "city": "彭州"
  },
  {
    "cityid": 101270113,
    "city": "邛崃"
  },
  {
    "cityid": 101270114,
    "city": "崇州"
  },
  {
    "cityid": 101270115,
    "city": "青白江"
  },
  {
    "cityid": 101270201,
    "city": "攀枝花"
  },
  {
    "cityid": 101270202,
    "city": "仁和"
  },
  {
    "cityid": 101270203,
    "city": "米易"
  },
  {
    "cityid": 101270204,
    "city": "盐边"
  },
  {
    "cityid": 101270301,
    "city": "自贡"
  },
  {
    "cityid": 101270302,
    "city": "富顺"
  },
  {
    "cityid": 101270303,
    "city": "荣县"
  },
  {
    "cityid": 101270401,
    "city": "绵阳"
  },
  {
    "cityid": 101270402,
    "city": "三台"
  },
  {
    "cityid": 101270403,
    "city": "盐亭"
  },
  {
    "cityid": 101270404,
    "city": "安县"
  },
  {
    "cityid": 101270405,
    "city": "梓潼"
  },
  {
    "cityid": 101270406,
    "city": "北川"
  },
  {
    "cityid": 101270407,
    "city": "平武"
  },
  {
    "cityid": 101270408,
    "city": "江油"
  },
  {
    "cityid": 101270501,
    "city": "南充"
  },
  {
    "cityid": 101270502,
    "city": "南部"
  },
  {
    "cityid": 101270503,
    "city": "营山"
  },
  {
    "cityid": 101270504,
    "city": "蓬安"
  },
  {
    "cityid": 101270505,
    "city": "仪陇"
  },
  {
    "cityid": 101270506,
    "city": "西充"
  },
  {
    "cityid": 101270507,
    "city": "阆中"
  },
  {
    "cityid": 101270601,
    "city": "达州"
  },
  {
    "cityid": 101270602,
    "city": "宣汉"
  },
  {
    "cityid": 101270603,
    "city": "开江"
  },
  {
    "cityid": 101270604,
    "city": "大竹"
  },
  {
    "cityid": 101270605,
    "city": "渠县"
  },
  {
    "cityid": 101270606,
    "city": "万源"
  },
  {
    "cityid": 101270607,
    "city": "通川"
  },
  {
    "cityid": 101270608,
    "city": "达县"
  },
  {
    "cityid": 101270701,
    "city": "遂宁"
  },
  {
    "cityid": 101270702,
    "city": "蓬溪"
  },
  {
    "cityid": 101270703,
    "city": "射洪"
  },
  {
    "cityid": 101270801,
    "city": "广安"
  },
  {
    "cityid": 101270802,
    "city": "岳池"
  },
  {
    "cityid": 101270803,
    "city": "武胜"
  },
  {
    "cityid": 101270804,
    "city": "邻水"
  },
  {
    "cityid": 101270805,
    "city": "华蓥"
  },
  {
    "cityid": 101270901,
    "city": "巴中"
  },
  {
    "cityid": 101270902,
    "city": "通江"
  },
  {
    "cityid": 101270903,
    "city": "南江"
  },
  {
    "cityid": 101270904,
    "city": "平昌"
  },
  {
    "cityid": 101271001,
    "city": "泸州"
  },
  {
    "cityid": 101271003,
    "city": "泸县"
  },
  {
    "cityid": 101271004,
    "city": "合江"
  },
  {
    "cityid": 101271005,
    "city": "叙永"
  },
  {
    "cityid": 101271006,
    "city": "古蔺"
  },
  {
    "cityid": 101271007,
    "city": "纳溪"
  },
  {
    "cityid": 101271101,
    "city": "宜宾"
  },
  {
    "cityid": 101271103,
    "city": "宜宾县"
  },
  {
    "cityid": 101271104,
    "city": "南溪"
  },
  {
    "cityid": 101271105,
    "city": "江安"
  },
  {
    "cityid": 101271106,
    "city": "长宁"
  },
  {
    "cityid": 101271107,
    "city": "高县"
  },
  {
    "cityid": 101271108,
    "city": "珙县"
  },
  {
    "cityid": 101271109,
    "city": "筠连"
  },
  {
    "cityid": 101271110,
    "city": "兴文"
  },
  {
    "cityid": 101271111,
    "city": "屏山"
  },
  {
    "cityid": 101271201,
    "city": "内江"
  },
  {
    "cityid": 101271202,
    "city": "东兴"
  },
  {
    "cityid": 101271203,
    "city": "威远"
  },
  {
    "cityid": 101271204,
    "city": "资中"
  },
  {
    "cityid": 101271205,
    "city": "隆昌"
  },
  {
    "cityid": 101271301,
    "city": "资阳"
  },
  {
    "cityid": 101271302,
    "city": "安岳"
  },
  {
    "cityid": 101271303,
    "city": "乐至"
  },
  {
    "cityid": 101271304,
    "city": "简阳"
  },
  {
    "cityid": 101271401,
    "city": "乐山"
  },
  {
    "cityid": 101271402,
    "city": "犍为"
  },
  {
    "cityid": 101271403,
    "city": "井研"
  },
  {
    "cityid": 101271404,
    "city": "夹江"
  },
  {
    "cityid": 101271405,
    "city": "沐川"
  },
  {
    "cityid": 101271406,
    "city": "峨边"
  },
  {
    "cityid": 101271407,
    "city": "马边"
  },
  {
    "cityid": 101271408,
    "city": "峨眉"
  },
  {
    "cityid": 101271409,
    "city": "峨眉山"
  },
  {
    "cityid": 101271501,
    "city": "眉山"
  },
  {
    "cityid": 101271502,
    "city": "仁寿"
  },
  {
    "cityid": 101271503,
    "city": "彭山"
  },
  {
    "cityid": 101271504,
    "city": "洪雅"
  },
  {
    "cityid": 101271505,
    "city": "丹棱"
  },
  {
    "cityid": 101271506,
    "city": "青神"
  },
  {
    "cityid": 101271601,
    "city": "凉山"
  },
  {
    "cityid": 101271603,
    "city": "木里"
  },
  {
    "cityid": 101271604,
    "city": "盐源"
  },
  {
    "cityid": 101271605,
    "city": "德昌"
  },
  {
    "cityid": 101271606,
    "city": "会理"
  },
  {
    "cityid": 101271607,
    "city": "会东"
  },
  {
    "cityid": 101271608,
    "city": "宁南"
  },
  {
    "cityid": 101271609,
    "city": "普格"
  },
  {
    "cityid": 101271610,
    "city": "西昌"
  },
  {
    "cityid": 101271611,
    "city": "金阳"
  },
  {
    "cityid": 101271612,
    "city": "昭觉"
  },
  {
    "cityid": 101271613,
    "city": "喜德"
  },
  {
    "cityid": 101271614,
    "city": "冕宁"
  },
  {
    "cityid": 101271615,
    "city": "越西"
  },
  {
    "cityid": 101271616,
    "city": "甘洛"
  },
  {
    "cityid": 101271617,
    "city": "雷波"
  },
  {
    "cityid": 101271618,
    "city": "美姑"
  },
  {
    "cityid": 101271619,
    "city": "布拖"
  },
  {
    "cityid": 101271701,
    "city": "雅安"
  },
  {
    "cityid": 101271702,
    "city": "名山"
  },
  {
    "cityid": 101271703,
    "city": "荥经"
  },
  {
    "cityid": 101271704,
    "city": "汉源"
  },
  {
    "cityid": 101271705,
    "city": "石棉"
  },
  {
    "cityid": 101271706,
    "city": "天全"
  },
  {
    "cityid": 101271707,
    "city": "芦山"
  },
  {
    "cityid": 101271708,
    "city": "宝兴"
  },
  {
    "cityid": 101271801,
    "city": "甘孜"
  },
  {
    "cityid": 101271802,
    "city": "康定"
  },
  {
    "cityid": 101271803,
    "city": "泸定"
  },
  {
    "cityid": 101271804,
    "city": "丹巴"
  },
  {
    "cityid": 101271805,
    "city": "九龙"
  },
  {
    "cityid": 101271806,
    "city": "雅江"
  },
  {
    "cityid": 101271807,
    "city": "道孚"
  },
  {
    "cityid": 101271808,
    "city": "炉霍"
  },
  {
    "cityid": 101271809,
    "city": "新龙"
  },
  {
    "cityid": 101271810,
    "city": "德格"
  },
  {
    "cityid": 101271811,
    "city": "白玉"
  },
  {
    "cityid": 101271812,
    "city": "石渠"
  },
  {
    "cityid": 101271813,
    "city": "色达"
  },
  {
    "cityid": 101271814,
    "city": "理塘"
  },
  {
    "cityid": 101271815,
    "city": "巴塘"
  },
  {
    "cityid": 101271816,
    "city": "乡城"
  },
  {
    "cityid": 101271817,
    "city": "稻城"
  },
  {
    "cityid": 101271818,
    "city": "得荣"
  },
  {
    "cityid": 101271901,
    "city": "阿坝"
  },
  {
    "cityid": 101271902,
    "city": "汶川"
  },
  {
    "cityid": 101271903,
    "city": "理县"
  },
  {
    "cityid": 101271904,
    "city": "茂县"
  },
  {
    "cityid": 101271905,
    "city": "松潘"
  },
  {
    "cityid": 101271906,
    "city": "九寨沟"
  },
  {
    "cityid": 101271907,
    "city": "金川"
  },
  {
    "cityid": 101271908,
    "city": "小金"
  },
  {
    "cityid": 101271909,
    "city": "黑水"
  },
  {
    "cityid": 101271910,
    "city": "马尔康"
  },
  {
    "cityid": 101271911,
    "city": "壤塘"
  },
  {
    "cityid": 101271912,
    "city": "若尔盖"
  },
  {
    "cityid": 101271913,
    "city": "红原"
  },
  {
    "cityid": 101272001,
    "city": "德阳"
  },
  {
    "cityid": 101272002,
    "city": "中江"
  },
  {
    "cityid": 101272003,
    "city": "广汉"
  },
  {
    "cityid": 101272004,
    "city": "什邡"
  },
  {
    "cityid": 101272005,
    "city": "绵竹"
  },
  {
    "cityid": 101272006,
    "city": "罗江"
  },
  {
    "cityid": 101272101,
    "city": "广元"
  },
  {
    "cityid": 101272102,
    "city": "旺苍"
  },
  {
    "cityid": 101272103,
    "city": "青川"
  },
  {
    "cityid": 101272104,
    "city": "剑阁"
  },
  {
    "cityid": 101272105,
    "city": "苍溪"
  },
  {
    "cityid": 101280101,
    "city": "广州"
  },
  {
    "cityid": 101280102,
    "city": "番禺"
  },
  {
    "cityid": 101280103,
    "city": "从化"
  },
  {
    "cityid": 101280104,
    "city": "增城"
  },
  {
    "cityid": 101280105,
    "city": "花都"
  },
  {
    "cityid": 101280201,
    "city": "韶关"
  },
  {
    "cityid": 101280202,
    "city": "乳源"
  },
  {
    "cityid": 101280203,
    "city": "始兴"
  },
  {
    "cityid": 101280204,
    "city": "翁源"
  },
  {
    "cityid": 101280205,
    "city": "乐昌"
  },
  {
    "cityid": 101280206,
    "city": "仁化"
  },
  {
    "cityid": 101280207,
    "city": "南雄"
  },
  {
    "cityid": 101280208,
    "city": "新丰"
  },
  {
    "cityid": 101280209,
    "city": "曲江"
  },
  {
    "cityid": 101280210,
    "city": "浈江"
  },
  {
    "cityid": 101280211,
    "city": "武江"
  },
  {
    "cityid": 101280301,
    "city": "惠州"
  },
  {
    "cityid": 101280302,
    "city": "博罗"
  },
  {
    "cityid": 101280303,
    "city": "惠阳"
  },
  {
    "cityid": 101280304,
    "city": "惠东"
  },
  {
    "cityid": 101280305,
    "city": "龙门"
  },
  {
    "cityid": 101280401,
    "city": "梅州"
  },
  {
    "cityid": 101280402,
    "city": "兴宁"
  },
  {
    "cityid": 101280403,
    "city": "蕉岭"
  },
  {
    "cityid": 101280404,
    "city": "大埔"
  },
  {
    "cityid": 101280406,
    "city": "丰顺"
  },
  {
    "cityid": 101280407,
    "city": "平远"
  },
  {
    "cityid": 101280408,
    "city": "五华"
  },
  {
    "cityid": 101280409,
    "city": "梅县"
  },
  {
    "cityid": 101280501,
    "city": "汕头"
  },
  {
    "cityid": 101280502,
    "city": "潮阳"
  },
  {
    "cityid": 101280503,
    "city": "澄海"
  },
  {
    "cityid": 101280504,
    "city": "南澳"
  },
  {
    "cityid": 101280601,
    "city": "深圳"
  },
  {
    "cityid": 101280701,
    "city": "珠海"
  },
  {
    "cityid": 101280702,
    "city": "斗门"
  },
  {
    "cityid": 101280703,
    "city": "金湾"
  },
  {
    "cityid": 101280800,
    "city": "佛山"
  },
  {
    "cityid": 101280801,
    "city": "顺德"
  },
  {
    "cityid": 101280802,
    "city": "三水"
  },
  {
    "cityid": 101280803,
    "city": "南海"
  },
  {
    "cityid": 101280804,
    "city": "高明"
  },
  {
    "cityid": 101280901,
    "city": "肇庆"
  },
  {
    "cityid": 101280902,
    "city": "广宁"
  },
  {
    "cityid": 101280903,
    "city": "四会"
  },
  {
    "cityid": 101280905,
    "city": "德庆"
  },
  {
    "cityid": 101280906,
    "city": "怀集"
  },
  {
    "cityid": 101280907,
    "city": "封开"
  },
  {
    "cityid": 101280908,
    "city": "高要"
  },
  {
    "cityid": 101281001,
    "city": "湛江"
  },
  {
    "cityid": 101281002,
    "city": "吴川"
  },
  {
    "cityid": 101281003,
    "city": "雷州"
  },
  {
    "cityid": 101281004,
    "city": "徐闻"
  },
  {
    "cityid": 101281005,
    "city": "廉江"
  },
  {
    "cityid": 101281006,
    "city": "赤坎"
  },
  {
    "cityid": 101281007,
    "city": "遂溪"
  },
  {
    "cityid": 101281008,
    "city": "坡头"
  },
  {
    "cityid": 101281009,
    "city": "霞山"
  },
  {
    "cityid": 101281010,
    "city": "麻章"
  },
  {
    "cityid": 101281101,
    "city": "江门"
  },
  {
    "cityid": 101281103,
    "city": "开平"
  },
  {
    "cityid": 101281104,
    "city": "新会"
  },
  {
    "cityid": 101281105,
    "city": "恩平"
  },
  {
    "cityid": 101281106,
    "city": "台山"
  },
  {
    "cityid": 101281107,
    "city": "蓬江"
  },
  {
    "cityid": 101281108,
    "city": "鹤山"
  },
  {
    "cityid": 101281109,
    "city": "江海"
  },
  {
    "cityid": 101281201,
    "city": "河源"
  },
  {
    "cityid": 101281202,
    "city": "紫金"
  },
  {
    "cityid": 101281203,
    "city": "连平"
  },
  {
    "cityid": 101281204,
    "city": "和平"
  },
  {
    "cityid": 101281205,
    "city": "龙川"
  },
  {
    "cityid": 101281206,
    "city": "东源"
  },
  {
    "cityid": 101281301,
    "city": "清远"
  },
  {
    "cityid": 101281302,
    "city": "连南"
  },
  {
    "cityid": 101281303,
    "city": "连州"
  },
  {
    "cityid": 101281304,
    "city": "连山"
  },
  {
    "cityid": 101281305,
    "city": "阳山"
  },
  {
    "cityid": 101281306,
    "city": "佛冈"
  },
  {
    "cityid": 101281307,
    "city": "英德"
  },
  {
    "cityid": 101281308,
    "city": "清新"
  },
  {
    "cityid": 101281401,
    "city": "云浮"
  },
  {
    "cityid": 101281402,
    "city": "罗定"
  },
  {
    "cityid": 101281403,
    "city": "新兴"
  },
  {
    "cityid": 101281404,
    "city": "郁南"
  },
  {
    "cityid": 101281406,
    "city": "云安"
  },
  {
    "cityid": 101281501,
    "city": "潮州"
  },
  {
    "cityid": 101281502,
    "city": "饶平"
  },
  {
    "cityid": 101281503,
    "city": "潮安"
  },
  {
    "cityid": 101281601,
    "city": "东莞"
  },
  {
    "cityid": 101281701,
    "city": "中山"
  },
  {
    "cityid": 101281801,
    "city": "阳江"
  },
  {
    "cityid": 101281802,
    "city": "阳春"
  },
  {
    "cityid": 101281803,
    "city": "阳东"
  },
  {
    "cityid": 101281804,
    "city": "阳西"
  },
  {
    "cityid": 101281901,
    "city": "揭阳"
  },
  {
    "cityid": 101281902,
    "city": "揭西"
  },
  {
    "cityid": 101281903,
    "city": "普宁"
  },
  {
    "cityid": 101281904,
    "city": "惠来"
  },
  {
    "cityid": 101281905,
    "city": "揭东"
  },
  {
    "cityid": 101282001,
    "city": "茂名"
  },
  {
    "cityid": 101282002,
    "city": "高州"
  },
  {
    "cityid": 101282003,
    "city": "化州"
  },
  {
    "cityid": 101282004,
    "city": "电白"
  },
  {
    "cityid": 101282005,
    "city": "信宜"
  },
  {
    "cityid": 101282006,
    "city": "茂港"
  },
  {
    "cityid": 101282101,
    "city": "汕尾"
  },
  {
    "cityid": 101282102,
    "city": "海丰"
  },
  {
    "cityid": 101282103,
    "city": "陆丰"
  },
  {
    "cityid": 101282104,
    "city": "陆河"
  },
  {
    "cityid": 101290101,
    "city": "昆明"
  },
  {
    "cityid": 101290103,
    "city": "东川"
  },
  {
    "cityid": 101290104,
    "city": "寻甸"
  },
  {
    "cityid": 101290105,
    "city": "晋宁"
  },
  {
    "cityid": 101290106,
    "city": "宜良"
  },
  {
    "cityid": 101290107,
    "city": "石林"
  },
  {
    "cityid": 101290108,
    "city": "呈贡"
  },
  {
    "cityid": 101290109,
    "city": "富民"
  },
  {
    "cityid": 101290110,
    "city": "嵩明"
  },
  {
    "cityid": 101290111,
    "city": "禄劝"
  },
  {
    "cityid": 101290112,
    "city": "安宁"
  },
  {
    "cityid": 101290113,
    "city": "太华山"
  },
  {
    "cityid": 101290201,
    "city": "大理"
  },
  {
    "cityid": 101290202,
    "city": "云龙"
  },
  {
    "cityid": 101290203,
    "city": "漾濞"
  },
  {
    "cityid": 101290204,
    "city": "永平"
  },
  {
    "cityid": 101290205,
    "city": "宾川"
  },
  {
    "cityid": 101290206,
    "city": "弥渡"
  },
  {
    "cityid": 101290207,
    "city": "祥云"
  },
  {
    "cityid": 101290208,
    "city": "巍山"
  },
  {
    "cityid": 101290209,
    "city": "剑川"
  },
  {
    "cityid": 101290210,
    "city": "洱源"
  },
  {
    "cityid": 101290211,
    "city": "鹤庆"
  },
  {
    "cityid": 101290212,
    "city": "南涧"
  },
  {
    "cityid": 101290301,
    "city": "红河"
  },
  {
    "cityid": 101290302,
    "city": "石屏"
  },
  {
    "cityid": 101290303,
    "city": "建水"
  },
  {
    "cityid": 101290304,
    "city": "弥勒"
  },
  {
    "cityid": 101290305,
    "city": "元阳"
  },
  {
    "cityid": 101290306,
    "city": "绿春"
  },
  {
    "cityid": 101290307,
    "city": "开远"
  },
  {
    "cityid": 101290308,
    "city": "个旧"
  },
  {
    "cityid": 101290309,
    "city": "蒙自"
  },
  {
    "cityid": 101290310,
    "city": "屏边"
  },
  {
    "cityid": 101290311,
    "city": "泸西"
  },
  {
    "cityid": 101290312,
    "city": "金平"
  },
  {
    "cityid": 101290313,
    "city": "河口"
  },
  {
    "cityid": 101290401,
    "city": "曲靖"
  },
  {
    "cityid": 101290402,
    "city": "沾益"
  },
  {
    "cityid": 101290403,
    "city": "陆良"
  },
  {
    "cityid": 101290404,
    "city": "富源"
  },
  {
    "cityid": 101290405,
    "city": "马龙"
  },
  {
    "cityid": 101290406,
    "city": "师宗"
  },
  {
    "cityid": 101290407,
    "city": "罗平"
  },
  {
    "cityid": 101290408,
    "city": "会泽"
  },
  {
    "cityid": 101290409,
    "city": "宣威"
  },
  {
    "cityid": 101290501,
    "city": "保山"
  },
  {
    "cityid": 101290503,
    "city": "龙陵"
  },
  {
    "cityid": 101290504,
    "city": "施甸"
  },
  {
    "cityid": 101290505,
    "city": "昌宁"
  },
  {
    "cityid": 101290506,
    "city": "腾冲"
  },
  {
    "cityid": 101290601,
    "city": "文山"
  },
  {
    "cityid": 101290602,
    "city": "西畴"
  },
  {
    "cityid": 101290603,
    "city": "马关"
  },
  {
    "cityid": 101290604,
    "city": "麻栗坡"
  },
  {
    "cityid": 101290605,
    "city": "砚山"
  },
  {
    "cityid": 101290606,
    "city": "丘北"
  },
  {
    "cityid": 101290607,
    "city": "广南"
  },
  {
    "cityid": 101290608,
    "city": "富宁"
  },
  {
    "cityid": 101290701,
    "city": "玉溪"
  },
  {
    "cityid": 101290702,
    "city": "澄江"
  },
  {
    "cityid": 101290703,
    "city": "江川"
  },
  {
    "cityid": 101290704,
    "city": "通海"
  },
  {
    "cityid": 101290705,
    "city": "华宁"
  },
  {
    "cityid": 101290706,
    "city": "新平"
  },
  {
    "cityid": 101290707,
    "city": "易门"
  },
  {
    "cityid": 101290708,
    "city": "峨山"
  },
  {
    "cityid": 101290709,
    "city": "元江"
  },
  {
    "cityid": 101290801,
    "city": "楚雄"
  },
  {
    "cityid": 101290802,
    "city": "大姚"
  },
  {
    "cityid": 101290803,
    "city": "元谋"
  },
  {
    "cityid": 101290804,
    "city": "姚安"
  },
  {
    "cityid": 101290805,
    "city": "牟定"
  },
  {
    "cityid": 101290806,
    "city": "南华"
  },
  {
    "cityid": 101290807,
    "city": "武定"
  },
  {
    "cityid": 101290808,
    "city": "禄丰"
  },
  {
    "cityid": 101290809,
    "city": "双柏"
  },
  {
    "cityid": 101290810,
    "city": "永仁"
  },
  {
    "cityid": 101290901,
    "city": "普洱"
  },
  {
    "cityid": 101290902,
    "city": "景谷"
  },
  {
    "cityid": 101290903,
    "city": "景东"
  },
  {
    "cityid": 101290904,
    "city": "澜沧"
  },
  {
    "cityid": 101290906,
    "city": "墨江"
  },
  {
    "cityid": 101290907,
    "city": "江城"
  },
  {
    "cityid": 101290908,
    "city": "孟连"
  },
  {
    "cityid": 101290909,
    "city": "西盟"
  },
  {
    "cityid": 101290911,
    "city": "镇沅"
  },
  {
    "cityid": 101290912,
    "city": "宁洱"
  },
  {
    "cityid": 101291001,
    "city": "昭通"
  },
  {
    "cityid": 101291002,
    "city": "鲁甸"
  },
  {
    "cityid": 101291003,
    "city": "彝良"
  },
  {
    "cityid": 101291004,
    "city": "镇雄"
  },
  {
    "cityid": 101291005,
    "city": "威信"
  },
  {
    "cityid": 101291006,
    "city": "巧家"
  },
  {
    "cityid": 101291007,
    "city": "绥江"
  },
  {
    "cityid": 101291008,
    "city": "永善"
  },
  {
    "cityid": 101291009,
    "city": "盐津"
  },
  {
    "cityid": 101291010,
    "city": "大关"
  },
  {
    "cityid": 101291011,
    "city": "水富"
  },
  {
    "cityid": 101291101,
    "city": "临沧"
  },
  {
    "cityid": 101291102,
    "city": "沧源"
  },
  {
    "cityid": 101291103,
    "city": "耿马"
  },
  {
    "cityid": 101291104,
    "city": "双江"
  },
  {
    "cityid": 101291105,
    "city": "凤庆"
  },
  {
    "cityid": 101291106,
    "city": "永德"
  },
  {
    "cityid": 101291107,
    "city": "云县"
  },
  {
    "cityid": 101291108,
    "city": "镇康"
  },
  {
    "cityid": 101291201,
    "city": "怒江"
  },
  {
    "cityid": 101291203,
    "city": "福贡"
  },
  {
    "cityid": 101291204,
    "city": "兰坪"
  },
  {
    "cityid": 101291205,
    "city": "泸水"
  },
  {
    "cityid": 101291206,
    "city": "六库"
  },
  {
    "cityid": 101291207,
    "city": "贡山"
  },
  {
    "cityid": 101291301,
    "city": "香格里拉"
  },
  {
    "cityid": 101291302,
    "city": "德钦"
  },
  {
    "cityid": 101291303,
    "city": "维西"
  },
  {
    "cityid": 101291304,
    "city": "中甸"
  },
  {
    "cityid": 101291401,
    "city": "丽江"
  },
  {
    "cityid": 101291402,
    "city": "永胜"
  },
  {
    "cityid": 101291403,
    "city": "华坪"
  },
  {
    "cityid": 101291404,
    "city": "宁蒗"
  },
  {
    "cityid": 101291501,
    "city": "德宏"
  },
  {
    "cityid": 101291503,
    "city": "陇川"
  },
  {
    "cityid": 101291504,
    "city": "盈江"
  },
  {
    "cityid": 101291506,
    "city": "瑞丽"
  },
  {
    "cityid": 101291507,
    "city": "梁河"
  },
  {
    "cityid": 101291508,
    "city": "潞西"
  },
  {
    "cityid": 101291601,
    "city": "景洪"
  },
  {
    "cityid": 101291603,
    "city": "勐海"
  },
  {
    "cityid": 101291605,
    "city": "勐腊"
  },
  {
    "cityid": 101300101,
    "city": "南宁"
  },
  {
    "cityid": 101300103,
    "city": "邕宁"
  },
  {
    "cityid": 101300104,
    "city": "横县"
  },
  {
    "cityid": 101300105,
    "city": "隆安"
  },
  {
    "cityid": 101300106,
    "city": "马山"
  },
  {
    "cityid": 101300107,
    "city": "上林"
  },
  {
    "cityid": 101300108,
    "city": "武鸣"
  },
  {
    "cityid": 101300109,
    "city": "宾阳"
  },
  {
    "cityid": 101300201,
    "city": "崇左"
  },
  {
    "cityid": 101300202,
    "city": "天等"
  },
  {
    "cityid": 101300203,
    "city": "龙州"
  },
  {
    "cityid": 101300204,
    "city": "凭祥"
  },
  {
    "cityid": 101300205,
    "city": "大新"
  },
  {
    "cityid": 101300206,
    "city": "扶绥"
  },
  {
    "cityid": 101300207,
    "city": "宁明"
  },
  {
    "cityid": 101300301,
    "city": "柳州"
  },
  {
    "cityid": 101300302,
    "city": "柳城"
  },
  {
    "cityid": 101300304,
    "city": "鹿寨"
  },
  {
    "cityid": 101300305,
    "city": "柳江"
  },
  {
    "cityid": 101300306,
    "city": "融安"
  },
  {
    "cityid": 101300307,
    "city": "融水"
  },
  {
    "cityid": 101300308,
    "city": "三江"
  },
  {
    "cityid": 101300401,
    "city": "来宾"
  },
  {
    "cityid": 101300402,
    "city": "忻城"
  },
  {
    "cityid": 101300403,
    "city": "金秀"
  },
  {
    "cityid": 101300404,
    "city": "象州"
  },
  {
    "cityid": 101300405,
    "city": "武宣"
  },
  {
    "cityid": 101300406,
    "city": "合山"
  },
  {
    "cityid": 101300501,
    "city": "桂林"
  },
  {
    "cityid": 101300503,
    "city": "龙胜"
  },
  {
    "cityid": 101300504,
    "city": "永福"
  },
  {
    "cityid": 101300505,
    "city": "临桂"
  },
  {
    "cityid": 101300506,
    "city": "兴安"
  },
  {
    "cityid": 101300507,
    "city": "灵川"
  },
  {
    "cityid": 101300508,
    "city": "全州"
  },
  {
    "cityid": 101300509,
    "city": "灌阳"
  },
  {
    "cityid": 101300510,
    "city": "阳朔"
  },
  {
    "cityid": 101300511,
    "city": "恭城"
  },
  {
    "cityid": 101300512,
    "city": "平乐"
  },
  {
    "cityid": 101300513,
    "city": "荔浦"
  },
  {
    "cityid": 101300514,
    "city": "资源"
  },
  {
    "cityid": 101300601,
    "city": "梧州"
  },
  {
    "cityid": 101300602,
    "city": "藤县"
  },
  {
    "cityid": 101300604,
    "city": "苍梧"
  },
  {
    "cityid": 101300605,
    "city": "蒙山"
  },
  {
    "cityid": 101300606,
    "city": "岑溪"
  },
  {
    "cityid": 101300701,
    "city": "贺州"
  },
  {
    "cityid": 101300702,
    "city": "昭平"
  },
  {
    "cityid": 101300703,
    "city": "富川"
  },
  {
    "cityid": 101300704,
    "city": "钟山"
  },
  {
    "cityid": 101300801,
    "city": "贵港"
  },
  {
    "cityid": 101300802,
    "city": "桂平"
  },
  {
    "cityid": 101300803,
    "city": "平南"
  },
  {
    "cityid": 101300901,
    "city": "玉林"
  },
  {
    "cityid": 101300902,
    "city": "博白"
  },
  {
    "cityid": 101300903,
    "city": "北流"
  },
  {
    "cityid": 101300904,
    "city": "容县"
  },
  {
    "cityid": 101300905,
    "city": "陆川"
  },
  {
    "cityid": 101300906,
    "city": "兴业"
  },
  {
    "cityid": 101301001,
    "city": "百色"
  },
  {
    "cityid": 101301002,
    "city": "那坡"
  },
  {
    "cityid": 101301003,
    "city": "田阳"
  },
  {
    "cityid": 101301004,
    "city": "德保"
  },
  {
    "cityid": 101301005,
    "city": "靖西"
  },
  {
    "cityid": 101301006,
    "city": "田东"
  },
  {
    "cityid": 101301007,
    "city": "平果"
  },
  {
    "cityid": 101301008,
    "city": "隆林"
  },
  {
    "cityid": 101301009,
    "city": "西林"
  },
  {
    "cityid": 101301010,
    "city": "乐业"
  },
  {
    "cityid": 101301011,
    "city": "凌云"
  },
  {
    "cityid": 101301012,
    "city": "田林"
  },
  {
    "cityid": 101301101,
    "city": "钦州"
  },
  {
    "cityid": 101301102,
    "city": "浦北"
  },
  {
    "cityid": 101301103,
    "city": "灵山"
  },
  {
    "cityid": 101301201,
    "city": "河池"
  },
  {
    "cityid": 101301202,
    "city": "天峨"
  },
  {
    "cityid": 101301203,
    "city": "东兰"
  },
  {
    "cityid": 101301204,
    "city": "巴马"
  },
  {
    "cityid": 101301205,
    "city": "环江"
  },
  {
    "cityid": 101301206,
    "city": "罗城"
  },
  {
    "cityid": 101301207,
    "city": "宜州"
  },
  {
    "cityid": 101301208,
    "city": "凤山"
  },
  {
    "cityid": 101301209,
    "city": "南丹"
  },
  {
    "cityid": 101301210,
    "city": "都安"
  },
  {
    "cityid": 101301211,
    "city": "大化"
  },
  {
    "cityid": 101301301,
    "city": "北海"
  },
  {
    "cityid": 101301302,
    "city": "合浦"
  },
  {
    "cityid": 101301303,
    "city": "涠洲岛"
  },
  {
    "cityid": 101301401,
    "city": "防城港"
  },
  {
    "cityid": 101301402,
    "city": "上思"
  },
  {
    "cityid": 101301403,
    "city": "东兴"
  },
  {
    "cityid": 101301405,
    "city": "防城"
  },
  {
    "cityid": 101310101,
    "city": "海口"
  },
  {
    "cityid": 101310201,
    "city": "三亚"
  },
  {
    "cityid": 101310202,
    "city": "东方"
  },
  {
    "cityid": 101310203,
    "city": "临高"
  },
  {
    "cityid": 101310204,
    "city": "澄迈"
  },
  {
    "cityid": 101310205,
    "city": "儋州"
  },
  {
    "cityid": 101310206,
    "city": "昌江"
  },
  {
    "cityid": 101310207,
    "city": "白沙"
  },
  {
    "cityid": 101310208,
    "city": "琼中"
  },
  {
    "cityid": 101310209,
    "city": "定安"
  },
  {
    "cityid": 101310210,
    "city": "屯昌"
  },
  {
    "cityid": 101310211,
    "city": "琼海"
  },
  {
    "cityid": 101310212,
    "city": "文昌"
  },
  {
    "cityid": 101310214,
    "city": "保亭"
  },
  {
    "cityid": 101310215,
    "city": "万宁"
  },
  {
    "cityid": 101310216,
    "city": "陵水"
  },
  {
    "cityid": 101310217,
    "city": "西沙"
  },
  {
    "cityid": 101310220,
    "city": "南沙"
  },
  {
    "cityid": 101310221,
    "city": "乐东"
  },
  {
    "cityid": 101310222,
    "city": "五指山"
  },
  {
    "cityid": 101310224,
    "city": "中沙"
  },
  {
    "cityid": 101320101,
    "city": "香港"
  },
  {
    "cityid": 101320102,
    "city": "九龙"
  },
  {
    "cityid": 101320103,
    "city": "新界"
  },
  {
    "cityid": 101330101,
    "city": "澳门"
  },
  {
    "cityid": 101330102,
    "city": "氹仔岛"
  },
  {
    "cityid": 101330103,
    "city": "路环岛"
  },
  {
    "cityid": 101340101,
    "city": "台北"
  },
  {
    "cityid": 101340102,
    "city": "桃园"
  },
  {
    "cityid": 101340103,
    "city": "新竹"
  },
  {
    "cityid": 101340104,
    "city": "宜兰"
  },
  {
    "cityid": 101340201,
    "city": "高雄"
  },
  {
    "cityid": 101340202,
    "city": "嘉义"
  },
  {
    "cityid": 101340203,
    "city": "台南"
  },
  {
    "cityid": 101340204,
    "city": "台东"
  },
  {
    "cityid": 101340205,
    "city": "屏东"
  },
  {
    "cityid": 101340401,
    "city": "台中"
  },
  {
    "cityid": 101340402,
    "city": "苗栗"
  },
  {
    "cityid": 101340403,
    "city": "彰化"
  },
  {
    "cityid": 101340404,
    "city": "南投"
  },
  {
    "cityid": 101340405,
    "city": "花莲"
  },
  {
    "cityid": 101340406,
    "city": "云林"
  },
// 市级城市////////////////////////////////////////////////////////////////////////////////////////////////
    {
      "cityid": "北京",
      "city": "101010100"
    },
    {
      "cityid": "上海",
      "city": "101020100"
    },
    {
      "cityid": "天津",
      "city": "101030100"
    },
    {
      "cityid": "重庆",
      "city": "101040100"
    },
    {
      "cityid": "香港特别行政区",
      "city": "101320101"
    },
    {
      "cityid": "澳门特别行政区",
      "city": "101330101"
    },
    {
      "cityid": "哈尔滨",
      "city": "101050101"
    },
    {
      "cityid": "齐齐哈尔",
      "city": "101050201"
    },
    {
      "cityid": "牡丹江",
      "city": "101050301"
    },
    {
      "cityid": "大庆",
      "city": "101050901"
    },
    {
      "cityid": "伊春",
      "city": "101050801"
    },
    {
      "cityid": "双鸭山",
      "city": "101051301"
    },
    {
      "cityid": "鹤岗",
      "city": "101051201"
    },
    {
      "cityid": "鸡西",
      "city": "101051101"
    },
    {
      "cityid": "佳木斯",
      "city": "101050401"
    },
    {
      "cityid": "七台河",
      "city": "101051002"
    },
    {
      "cityid": "黑河",
      "city": "101050601"
    },
    {
      "cityid": "绥化",
      "city": "101050501"
    },
    {
      "cityid": "大兴安岭",
      "city": "101050701"
    },
    {
      "cityid": "长春",
      "city": "101060101"
    },
    {
      "cityid": "延吉",
      "city": "101060301"
    },
    {
      "cityid": "吉林",
      "city": "101060201"
    },
    {
      "cityid": "白山",
      "city": "101060901"
    },
    {
      "cityid": "白城",
      "city": "101060601"
    },
    {
      "cityid": "四平",
      "city": "101060401"
    },
    {
      "cityid": "松原",
      "city": "101060801"
    },
    {
      "cityid": "辽源",
      "city": "101060701"
    },
    {
      "cityid": "大安",
      "city": "101060603"
    },
    {
      "cityid": "通化",
      "city": "101060501"
    },
    {
      "cityid": "沈阳",
      "city": "101070101"
    },
    {
      "cityid": "大连",
      "city": "101070201"
    },
    {
      "cityid": "葫芦岛",
      "city": "101071401"
    },
    {
      "cityid": "盘锦",
      "city": "101071301"
    },
    {
      "cityid": "本溪",
      "city": "101070501"
    },
    {
      "cityid": "抚顺",
      "city": "101070401"
    },
    {
      "cityid": "铁岭",
      "city": "101071101"
    },
    {
      "cityid": "辽阳",
      "city": "101071001"
    },
    {
      "cityid": "营口",
      "city": "101070801"
    },
    {
      "cityid": "阜新",
      "city": "101070901"
    },
    {
      "cityid": "朝阳",
      "city": "101071201"
    },
    {
      "cityid": "锦州",
      "city": "101070701"
    },
    {
      "cityid": "丹东",
      "city": "101070601"
    },
    {
      "cityid": "鞍山",
      "city": "101070301"
    },
    {
      "cityid": "呼和浩特",
      "city": "101080101"
    },
    {
      "cityid": "锡林浩特",
      "city": "101080901"
    },
    {
      "cityid": "包头",
      "city": "101080201"
    },
    {
      "cityid": "赤峰",
      "city": "101080601"
    },
    {
      "cityid": "海拉尔",
      "city": "101081001"
    },
    {
      "cityid": "乌海",
      "city": "101080301"
    },
    {
      "cityid": "鄂尔多斯",
      "city": "101080701"
    },
    {
      "cityid": "通辽",
      "city": "101080501"
    },
    {
      "cityid": "石家庄",
      "city": "101090101"
    },
    {
      "cityid": "唐山",
      "city": "101090501"
    },
    {
      "cityid": "张家口",
      "city": "101090301"
    },
    {
      "cityid": "廊坊",
      "city": "101090601"
    },
    {
      "cityid": "邢台",
      "city": "101090901"
    },
    {
      "cityid": "邯郸",
      "city": "101091001"
    },
    {
      "cityid": "沧州",
      "city": "101090701"
    },
    {
      "cityid": "衡水",
      "city": "101090801"
    },
    {
      "cityid": "承德",
      "city": "101090402"
    },
    {
      "cityid": "保定",
      "city": "101090201"
    },
    {
      "cityid": "秦皇岛",
      "city": "101091101"
    },
    {
      "cityid": "郑州",
      "city": "101180101"
    },
    {
      "cityid": "开封",
      "city": "101180801"
    },
    {
      "cityid": "洛阳",
      "city": "101180901"
    },
    {
      "cityid": "平顶山",
      "city": "101180501"
    },
    {
      "cityid": "焦作",
      "city": "101181101"
    },
    {
      "cityid": "鹤壁",
      "city": "101181201"
    },
    {
      "cityid": "新乡",
      "city": "101180301"
    },
    {
      "cityid": "安阳",
      "city": "101180201"
    },
    {
      "cityid": "濮阳",
      "city": "101181301"
    },
    {
      "cityid": "许昌",
      "city": "101180401"
    },
    {
      "cityid": "漯河",
      "city": "101181501"
    },
    {
      "cityid": "三门峡",
      "city": "101181701"
    },
    {
      "cityid": "南阳",
      "city": "101180701"
    },
    {
      "cityid": "商丘",
      "city": "101181001"
    },
    {
      "cityid": "信阳",
      "city": "101180601"
    },
    {
      "cityid": "周口",
      "city": "101181401"
    },
    {
      "cityid": "驻马店",
      "city": "101181601"
    },
    {
      "cityid": "济南",
      "city": "101120101"
    },
    {
      "cityid": "青岛",
      "city": "101120201"
    },
    {
      "cityid": "淄博",
      "city": "101120301"
    },
    {
      "cityid": "威海",
      "city": "101121301"
    },
    {
      "cityid": "曲阜",
      "city": "101120710"
    },
    {
      "cityid": "临沂",
      "city": "101120901"
    },
    {
      "cityid": "烟台",
      "city": "101120501"
    },
    {
      "cityid": "枣庄",
      "city": "101121401"
    },
    {
      "cityid": "聊城",
      "city": "101121701"
    },
    {
      "cityid": "济宁",
      "city": "101120701"
    },
    {
      "cityid": "菏泽",
      "city": "101121001"
    },
    {
      "cityid": "泰安",
      "city": "101120801"
    },
    {
      "cityid": "日照",
      "city": "101121501"
    },
    {
      "cityid": "东营",
      "city": "101121201"
    },
    {
      "cityid": "德州",
      "city": "101120401"
    },
    {
      "cityid": "滨州",
      "city": "101121101"
    },
    {
      "cityid": "莱芜",
      "city": "101121601"
    },
    {
      "cityid": "潍坊",
      "city": "101120601"
    },
    {
      "cityid": "太原",
      "city": "101100101"
    },
    {
      "cityid": "阳泉",
      "city": "101100301"
    },
    {
      "cityid": "晋城",
      "city": "101100601"
    },
    {
      "cityid": "晋中",
      "city": "101100401"
    },
    {
      "cityid": "临汾",
      "city": "101100701"
    },
    {
      "cityid": "运城",
      "city": "101100801"
    },
    {
      "cityid": "长治",
      "city": "101100501"
    },
    {
      "cityid": "朔州",
      "city": "101100901"
    },
    {
      "cityid": "忻州",
      "city": "101101001"
    },
    {
      "cityid": "大同",
      "city": "101100201"
    },
    {
      "cityid": "吕梁",
      "city": "101101101"
    },
    {
      "cityid": "南京",
      "city": "101190101"
    },
    {
      "cityid": "苏州",
      "city": "101190401"
    },
    {
      "cityid": "昆山",
      "city": "101190404"
    },
    {
      "cityid": "南通",
      "city": "101190501"
    },
    {
      "cityid": "太仓",
      "city": "101190408"
    },
    {
      "cityid": "吴县",
      "city": "101190406"
    },
    {
      "cityid": "徐州",
      "city": "101190801"
    },
    {
      "cityid": "宜兴",
      "city": "101190203"
    },
    {
      "cityid": "镇江",
      "city": "101190301"
    },
    {
      "cityid": "淮安",
      "city": "101190901"
    },
    {
      "cityid": "常熟",
      "city": "101190402"
    },
    {
      "cityid": "盐城",
      "city": "101190701"
    },
    {
      "cityid": "泰州",
      "city": "101191201"
    },
    {
      "cityid": "无锡",
      "city": "101190201"
    },
    {
      "cityid": "连云港",
      "city": "101191001"
    },
    {
      "cityid": "扬州",
      "city": "101190601"
    },
    {
      "cityid": "常州",
      "city": "101191101"
    },
    {
      "cityid": "宿迁",
      "city": "101191301"
    },
    {
      "cityid": "合肥",
      "city": "101220101"
    },
    {
      "cityid": "巢湖",
      "city": "101221601"
    },
    {
      "cityid": "蚌埠",
      "city": "101220201"
    },
    {
      "cityid": "安庆",
      "city": "101220601"
    },
    {
      "cityid": "六安",
      "city": "101221501"
    },
    {
      "cityid": "滁州",
      "city": "101221101"
    },
    {
      "cityid": "马鞍山",
      "city": "101220501"
    },
    {
      "cityid": "阜阳",
      "city": "101220801"
    },
    {
      "cityid": "宣城",
      "city": "101221401"
    },
    {
      "cityid": "铜陵",
      "city": "101221301"
    },
    {
      "cityid": "淮北",
      "city": "101221201"
    },
    {
      "cityid": "芜湖",
      "city": "101220301"
    },
    {
      "cityid": "亳州",
      "city": "101220901"
    },
    {
      "cityid": "宿州",
      "city": "101220701"
    },
    {
      "cityid": "淮南",
      "city": "101220401"
    },
    {
      "cityid": "池州",
      "city": "101221701"
    },
    {
      "cityid": "西安",
      "city": "101110101"
    },
    {
      "cityid": "韩城",
      "city": "101110510"
    },
    {
      "cityid": "安康",
      "city": "101110701"
    },
    {
      "cityid": "汉中",
      "city": "101110801"
    },
    {
      "cityid": "宝鸡",
      "city": "101110901"
    },
    {
      "cityid": "咸阳",
      "city": "101110200"
    },
    {
      "cityid": "榆林",
      "city": "101110401"
    },
    {
      "cityid": "渭南",
      "city": "101110501"
    },
    {
      "cityid": "商洛",
      "city": "101110601"
    },
    {
      "cityid": "铜川",
      "city": "101111001"
    },
    {
      "cityid": "延安",
      "city": "101110300"
    },
    {
      "cityid": "银川",
      "city": "101170101"
    },
    {
      "cityid": "固原",
      "city": "101170401"
    },
    {
      "cityid": "中卫",
      "city": "101170501"
    },
    {
      "cityid": "石嘴山",
      "city": "101170201"
    },
    {
      "cityid": "吴忠",
      "city": "101170301"
    },
    {
      "cityid": "兰州",
      "city": "101160101"
    },
    {
      "cityid": "白银",
      "city": "101161301"
    },
    {
      "cityid": "庆阳",
      "city": "101160401"
    },
    {
      "cityid": "酒泉",
      "city": "101160801"
    },
    {
      "cityid": "天水",
      "city": "101160901"
    },
    {
      "cityid": "武威",
      "city": "101160501"
    },
    {
      "cityid": "张掖",
      "city": "101160701"
    },
    {
      "cityid": "甘南",
      "city": "101050204"
    },
    {
      "cityid": "临夏",
      "city": "101161101"
    },
    {
      "cityid": "平凉",
      "city": "101160301"
    },
    {
      "cityid": "定西",
      "city": "101160201"
    },
    {
      "cityid": "金昌",
      "city": "101160601"
    },
    {
      "cityid": "西宁",
      "city": "101150101"
    },
    {
      "cityid": "海北",
      "city": "101150801"
    },
    {
      "cityid": "海西",
      "city": "101150701"
    },
    {
      "cityid": "黄南",
      "city": "101150301"
    },
    {
      "cityid": "果洛",
      "city": "101150501"
    },
    {
      "cityid": "玉树",
      "city": "101150601"
    },
    {
      "cityid": "海东",
      "city": "101150201"
    },
    {
      "cityid": "海南",
      "city": "101150401"
    },
    {
      "cityid": "武汉",
      "city": "101200101"
    },
    {
      "cityid": "宜昌",
      "city": "101200901"
    },
    {
      "cityid": "黄冈",
      "city": "101200501"
    },
    {
      "cityid": "恩施",
      "city": "101201001"
    },
    {
      "cityid": "荆州",
      "city": "101200801"
    },
    {
      "cityid": "神农架",
      "city": "101201201"
    },
    {
      "cityid": "十堰",
      "city": "101201101"
    },
    {
      "cityid": "咸宁",
      "city": "101200701"
    },
    {
      "cityid": "襄阳",
      "city": "101200201"
    },
    {
      "cityid": "孝感",
      "city": "101200401"
    },
    {
      "cityid": "随州",
      "city": "101201301"
    },
    {
      "cityid": "黄石",
      "city": "101200601"
    },
    {
      "cityid": "荆门",
      "city": "101201401"
    },
    {
      "cityid": "鄂州",
      "city": "101200301"
    },
    {
      "cityid": "长沙",
      "city": "101250101"
    },
    {
      "cityid": "邵阳",
      "city": "101250901"
    },
    {
      "cityid": "常德",
      "city": "101250601"
    },
    {
      "cityid": "郴州",
      "city": "101250501"
    },
    {
      "cityid": "吉首",
      "city": "101251501"
    },
    {
      "cityid": "株洲",
      "city": "101250301"
    },
    {
      "cityid": "娄底",
      "city": "101250801"
    },
    {
      "cityid": "湘潭",
      "city": "101250201"
    },
    {
      "cityid": "益阳",
      "city": "101250701"
    },
    {
      "cityid": "永州",
      "city": "101251401"
    },
    {
      "cityid": "岳阳",
      "city": "101251001"
    },
    {
      "cityid": "衡阳",
      "city": "101250401"
    },
    {
      "cityid": "怀化",
      "city": "101251201"
    },
    {
      "cityid": "韶山",
      "city": "101250202"
    },
    {
      "cityid": "张家界",
      "city": "101251101"
    },
    {
      "cityid": "杭州",
      "city": "101210101"
    },
    {
      "cityid": "湖州",
      "city": "101210201"
    },
    {
      "cityid": "金华",
      "city": "101210901"
    },
    {
      "cityid": "宁波",
      "city": "101210401"
    },
    {
      "cityid": "丽水",
      "city": "101210801"
    },
    {
      "cityid": "绍兴",
      "city": "101210501"
    },
    {
      "cityid": "衢州",
      "city": "101211001"
    },
    {
      "cityid": "嘉兴",
      "city": "101210301"
    },
    {
      "cityid": "台州",
      "city": "101210601"
    },
    {
      "cityid": "舟山",
      "city": "101211101"
    },
    {
      "cityid": "温州",
      "city": "101210701"
    },
    {
      "cityid": "南昌",
      "city": "101240101"
    },
    {
      "cityid": "萍乡",
      "city": "101240901"
    },
    {
      "cityid": "九江",
      "city": "101240201"
    },
    {
      "cityid": "上饶",
      "city": "101240301"
    },
    {
      "cityid": "抚州",
      "city": "101240401"
    },
    {
      "cityid": "吉安",
      "city": "101240601"
    },
    {
      "cityid": "鹰潭",
      "city": "101241101"
    },
    {
      "cityid": "宜春",
      "city": "101240501"
    },
    {
      "cityid": "新余",
      "city": "101241001"
    },
    {
      "cityid": "景德镇",
      "city": "101240801"
    },
    {
      "cityid": "赣州",
      "city": "101240701"
    },
    {
      "cityid": "福州",
      "city": "101230101"
    },
    {
      "cityid": "厦门",
      "city": "101230201"
    },
    {
      "cityid": "龙岩",
      "city": "101230701"
    },
    {
      "cityid": "南平",
      "city": "101230901"
    },
    {
      "cityid": "宁德",
      "city": "101230301"
    },
    {
      "cityid": "莆田",
      "city": "101230401"
    },
    {
      "cityid": "泉州",
      "city": "101230501"
    },
    {
      "cityid": "三明",
      "city": "101230801"
    },
    {
      "cityid": "漳州",
      "city": "101230601"
    },
    {
      "cityid": "贵阳",
      "city": "101260101"
    },
    {
      "cityid": "安顺",
      "city": "101260301"
    },
    {
      "cityid": "赤水",
      "city": "101260208"
    },
    {
      "cityid": "遵义",
      "city": "101260201"
    },
    {
      "cityid": "铜仁",
      "city": "101260601"
    },
    {
      "cityid": "六盘水",
      "city": "101260801"
    },
    {
      "cityid": "毕节",
      "city": "101260701"
    },
    {
      "cityid": "凯里",
      "city": "101260501"
    },
    {
      "cityid": "都匀",
      "city": "101260401"
    },
    {
      "cityid": "成都",
      "city": "101270101"
    },
    {
      "cityid": "泸州",
      "city": "101271001"
    },
    {
      "cityid": "内江",
      "city": "101271201"
    },
    {
      "cityid": "凉山",
      "city": "101271601"
    },
    {
      "cityid": "阿坝",
      "city": "101271901"
    },
    {
      "cityid": "巴中",
      "city": "101270901"
    },
    {
      "cityid": "广元",
      "city": "101272101"
    },
    {
      "cityid": "乐山",
      "city": "101271401"
    },
    {
      "cityid": "绵阳",
      "city": "101270401"
    },
    {
      "cityid": "德阳",
      "city": "101272001"
    },
    {
      "cityid": "攀枝花",
      "city": "101270201"
    },
    {
      "cityid": "雅安",
      "city": "101271701"
    },
    {
      "cityid": "宜宾",
      "city": "101271101"
    },
    {
      "cityid": "自贡",
      "city": "101270301"
    },
    {
      "cityid": "甘孜州",
      "city": "101271801"
    },
    {
      "cityid": "达州",
      "city": "101270601"
    },
    {
      "cityid": "资阳",
      "city": "101271301"
    },
    {
      "cityid": "广安",
      "city": "101270801"
    },
    {
      "cityid": "遂宁",
      "city": "101270701"
    },
    {
      "cityid": "眉山",
      "city": "101271501"
    },
    {
      "cityid": "南充",
      "city": "101270501"
    },
    {
      "cityid": "广州",
      "city": "101280101"
    },
    {
      "cityid": "深圳",
      "city": "101280601"
    },
    {
      "cityid": "潮州",
      "city": "101281501"
    },
    {
      "cityid": "韶关",
      "city": "101280201"
    },
    {
      "cityid": "湛江",
      "city": "101281001"
    },
    {
      "cityid": "惠州",
      "city": "101280301"
    },
    {
      "cityid": "清远",
      "city": "101281301"
    },
    {
      "cityid": "东莞",
      "city": "101281601"
    },
    {
      "cityid": "江门",
      "city": "101281101"
    },
    {
      "cityid": "茂名",
      "city": "101282001"
    },
    {
      "cityid": "肇庆",
      "city": "101280901"
    },
    {
      "cityid": "汕尾",
      "city": "101282101"
    },
    {
      "cityid": "河源",
      "city": "101281201"
    },
    {
      "cityid": "揭阳",
      "city": "101281901"
    },
    {
      "cityid": "梅州",
      "city": "101280401"
    },
    {
      "cityid": "中山",
      "city": "101281701"
    },
    {
      "cityid": "德庆",
      "city": "101280905"
    },
    {
      "cityid": "阳江",
      "city": "101281801"
    },
    {
      "cityid": "云浮",
      "city": "101281401"
    },
    {
      "cityid": "珠海",
      "city": "101280701"
    },
    {
      "cityid": "汕头",
      "city": "101280501"
    },
    {
      "cityid": "佛山",
      "city": "101280800"
    },
    {
      "cityid": "南宁",
      "city": "101300101"
    },
    {
      "cityid": "桂林",
      "city": "101300501"
    },
    {
      "cityid": "阳朔",
      "city": "101300510"
    },
    {
      "cityid": "柳州",
      "city": "101300301"
    },
    {
      "cityid": "梧州",
      "city": "101300601"
    },
    {
      "cityid": "玉林",
      "city": "101300901"
    },
    {
      "cityid": "桂平",
      "city": "101300802"
    },
    {
      "cityid": "贺州",
      "city": "101300701"
    },
    {
      "cityid": "钦州",
      "city": "101301101"
    },
    {
      "cityid": "贵港",
      "city": "101300801"
    },
    {
      "cityid": "防城港",
      "city": "101301401"
    },
    {
      "cityid": "百色",
      "city": "101301001"
    },
    {
      "cityid": "北海",
      "city": "101301301"
    },
    {
      "cityid": "河池",
      "city": "101301201"
    },
    {
      "cityid": "来宾",
      "city": "101300401"
    },
    {
      "cityid": "崇左",
      "city": "101300201"
    },
    {
      "cityid": "昆明",
      "city": "101290101"
    },
    {
      "cityid": "保山",
      "city": "101290501"
    },
    {
      "cityid": "楚雄",
      "city": "101290801"
    },
    {
      "cityid": "德宏",
      "city": "101291501"
    },
    {
      "cityid": "红河",
      "city": "101290301"
    },
    {
      "cityid": "临沧",
      "city": "101291101"
    },
    {
      "cityid": "怒江",
      "city": "101291201"
    },
    {
      "cityid": "曲靖",
      "city": "101290401"
    },
    {
      "cityid": "思茅",
      "city": "101290901"
    },
    {
      "cityid": "文山",
      "city": "101290601"
    },
    {
      "cityid": "玉溪",
      "city": "101290701"
    },
    {
      "cityid": "昭通",
      "city": "101291001"
    },
    {
      "cityid": "丽江",
      "city": "101291401"
    },
    {
      "cityid": "大理",
      "city": "101290201"
    },
    {
      "cityid": "海口",
      "city": "101310101"
    },
    {
      "cityid": "三亚",
      "city": "101310201"
    },
    {
      "cityid": "儋州",
      "city": "101310205"
    },
    {
      "cityid": "琼山",
      "city": "101310102"
    },
    {
      "cityid": "通什",
      "city": "101310222"
    },
    {
      "cityid": "文昌",
      "city": "101310212"
    },
    {
      "cityid": "乌鲁木齐",
      "city": "101130101"
    },
    {
      "cityid": "阿勒泰",
      "city": "101131401"
    },
    {
      "cityid": "阿克苏",
      "city": "101130801"
    },
    {
      "cityid": "昌吉",
      "city": "101130401"
    },
    {
      "cityid": "哈密",
      "city": "101131201"
    },
    {
      "cityid": "和田",
      "city": "101131301"
    },
    {
      "cityid": "喀什",
      "city": "101130901"
    },
    {
      "cityid": "克拉玛依",
      "city": "101130201"
    },
    {
      "cityid": "石河子",
      "city": "101130301"
    },
    {
      "cityid": "塔城",
      "city": "101131101"
    },
    {
      "cityid": "库尔勒",
      "city": "101130601"
    },
    {
      "cityid": "吐鲁番",
      "city": "101130501"
    },
    {
      "cityid": "伊宁",
      "city": "101131001"
    },
    {
      "cityid": "拉萨",
      "city": "101140101"
    },
    {
      "cityid": "阿里",
      "city": "101140701"
    },
    {
      "cityid": "昌都",
      "city": "101140501"
    },
    {
      "cityid": "那曲",
      "city": "101140601"
    },
    {
      "cityid": "日喀则",
      "city": "101140201"
    },
    {
      "cityid": "山南",
      "city": "101140301"
    },
    {
      "cityid": "林芝",
      "city": "101140401"
    },
    {
      "cityid": "台北",
      "city": "101340101"
    },
    {
      "cityid": "高雄",
      "city": "101340201"
    }
]
